{
  "version": "1.0",
  "feed_id": "69722878-9f3d-4985-b7c2-d263fc9a3fdf",
  "items": [
    {
      "item_id": "a8f97196-e636-463b-8e61-9c5b4bc7a603",
      "title": "The best Bluetooth trackers for Apple and Android phones",
      "link": "https://www.theverge.com/23769840/best-bluetooth-trackers",
      "published": "2026-01-26T20:01:17+00:00",
      "summary": "Some people rarely lose things. Wallets are always exactly where they’re supposed to be, keys never go missing, and remotes never slip between the couch cushions. And then there’s the rest of us — the folks who can’t ever seem to find the thing that was right there a few seconds ago. For us, there [&#8230;]",
      "content": "<figure>\n\n<img alt=\"Various Bluetooth trackers on a green background.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/257621_Bluetooth_trackers_guide_CVirginia2.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tBluetooth trackers come in all shapes and sizes. | ﻿Illustration: Cath Virginia / The Verge\t</figcaption>\n</figure>\n<p>Some people rarely lose things. Wallets are always exactly where they’re supposed to be, keys never go missing, and remotes never slip between the couch cushions. And then there’s the rest of us — the folks who can’t <em>ever</em> seem to find the thing that was <em>right</em> there a few seconds ago. For us, there are Bluetooth trackers.</p>\n\n<p>Bluetooth trackers have been around for a long time, and they all generally work the same way. You stick the tracker onto an object, pair it with your phone, and then, when you lose said object, you can go into an app and ring the tracker. But these days, Bluetooth trackers can do a lot more. Some have ultra-wideband chips that enable precision tracking, so you can find exactly where in a room your item is. Increasingly, trackers also tap into large networks — like Apple’s and Google’s — making it easier to locate lost items outside the home. Many will notify you if they detect you’ve left the device behind or come with QR codes that link to your contact information so people can easily return lost devices.</p>\n\n<p>These features are incredibly handy but also have the <a href=\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\">potential for misuse</a>. Take AirTags. When Apple launched the trackers, it hadn’t anticipated they’d be used to track people or stolen items — but <a href=\"https://abcnews.go.com/US/apple-airtags-causing-major-security-concerns-reports-stalking/story?id=96531871\">that’s exactly what happened</a>. It’s since <a href=\"https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking\">beefed up</a> <a href=\"https://www.apple.com/newsroom/2022/02/an-update-on-airtag-and-unwanted-tracking/\">its anti-stalking features</a>, and companies like Tile have also <a href=\"https://www.tile.com/en-us/blog/tile-introduces-scan-and-secure-feature-unwanted-tracking-safety\">followed suit</a>. Apple and Google have launched a standard that enables <a href=\"https://www.theverge.com/2024/5/13/24155630/apple-google-airtag-bluetooth-tracker-alert-standard\">unwanted tracking alerts across both Android and iOS devices</a> — and major players like Tile, Samsung, and Chipolo are on board. But until this standard is up and running, it pays to be aware of each tracker’s current approach when you’re deciding the best option for you.</p>\n\n<p>As a consummate Loser of Things, I’ve tested my fair share of Bluetooth trackers on wallets, keys, and luggage. Here’s what I’d recommend if you, too, have a hard time finding things.</p>\n\n<div class=\"wp-block-vox-media-highlight vox-media-highlight\">\n<h2 class=\"wp-block-heading\"></h2>\n\n\n</div>\n\n<h2 class=\"wp-block-heading\" id=\"zmtuOa\">The best tracker for iPhone users</h2>\n<div class=\"product-block\"><h3>Apple AirTag (first-gen)</h3>\n<div class=\"product-description\">Apple’s AirTags can help you find your lost items with their ultra wideband technology. You’ll get the best compatibility with an iPhone, though Apple released an Android app that can detect an AirTag’s location and notify you if one seems to be following you.</div>\n<figure class=\"product-image\"><img alt=\"An AirTag in an Apple keychain accessory\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/22461382/vpavic_4547_20210421_0058.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0CWXNS552\"> <strike>$29</strike> $25.99 at <strong>Amazon</strong></a></li><li><a href=\"https://www.walmart.com/ip/Apple-AirTag-1-Pack/475634131\"> <strike>$29</strike> $25.99 at <strong>Walmart</strong></a></li><li><a href=\"https://www.bestbuy.com/product/apple-airtag-silver/JJGCQ8XFQY\"> <strike>$29</strike> $27.99 at <strong>Best Buy</strong></a></li></ul></div>\n<p>When Apple launched AirTags in 2021, it really did shake up the category. That’s because AirTags are equipped with Apple’s Ultra Wideband (UWB) chip <em>and</em> tap into Apple’s vast Find My network. That’s a potent combo. And even though you can now get <a href=\"https://www.apple.com/icloud/find-my/\">third-party accessories that work with the Find My network</a> — including the Pebblebee trackers featured later in this guide — AirTags are still the best, thanks to UWB. </p>\n\n<p>Basically, UWB enables precision tracking while Find My compatibility expands range far, far beyond Bluetooth’s limitations. With precision tracking, all you have to do is open the Find My app, tap “Find,” and you should see an arrow pointing you in the exact direction you need to go to find your item. Using the Find My network also means that so long as there’s an Apple device nearby, a lost AirTag can ping its location to Apple’s iCloud servers without notifying the owners of those other devices. And there are over a billion Apple products out there.</p>\n\n<p>That accuracy is super convenient. My keys fell out of my pocket while running once, and I didn’t notice until my phone pinged me to say my keys were no longer with me. While I wasn’t able to use the precision tracking outdoors, I <em>could</em> see the last reported location in the Find My app. Twenty minutes had already passed, but I was still able to find my keys. I haven’t had that degree of success with any other item tracker.</p>\n<img alt=\"An AirTag wedged into some planks of wood.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/22461379/vpavic_4547_20210421_0038.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"An AirTag wedged into some planks of wood.\" />\n<p>However, this accuracy is a double-edged sword. In 2022, I ran a test to see whether I could track a friend and my spouse (with their consent) in real time. And I could, to a disturbing degree. While Apple’s unwanted tracking prevention measures worked, there were also inherent flaws. (You can read about our testing in full <a href=\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\">here</a>.) However, Apple has since <a href=\"https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking\">improved unwanted tracking alerts</a> by shortening the time before you’re notified an unknown AirTag is in your vicinity, making chimes louder, and creating <a href=\"https://www.theverge.com/2021/12/13/22832731/apple-android-app-airtag-search-tracker-detect-find-my\">a separate app</a> that lets Android users scan for unknown AirTags. Apple also now informs users during setup that unwanted tracking is a crime and that AirTags are “intended solely to track items that belong to you.”</p>\n\n<p>Apple has also added more ways to share AirTag locations with trusted people. iOS 17 <a href=\"https://www.theverge.com/2023/6/6/23751614/apple-airtag-find-my-sharing-ios-17-feature\">introduced AirTag sharing</a>, which means shared items won’t trigger unwanted tracking alerts. As of iOS 18.2, you can also <a href=\"https://www.theverge.com/2024/11/11/24293654/apple-ios-18-2-share-airtag-locations\">share the location of a lost AirTag</a> with other people via a temporary link. So if an airline loses your luggage, you can send them a link to an interactive map showing your item’s last known location. (Apple is partnering with more than 15 airlines for this particular use case.)</p>\n\n<p>The only thing I really don’t like about AirTags is that they aren’t truly $29. They’re $29, plus the cost of any accessory needed to attach them to the item you want to track. For example, you’ll need a holder to attach it to your keys or luggage. Thankfully, there’s a robust third-party accessory market, so you don’t have to pay Apple’s prices if you don’t want to. The fact that you can easily replace the battery with a regular CR2032 coin cell battery helps take the sting out, too. I’ve done it for two of my AirTags, and it’s much, <em>much</em> cheaper than buying two new ones.</p>\n\n<p>All that being said, it’s worth noting that <a href=\"https://www.theverge.com/news/867757/apple-airtag-new-uwb-bluetooth-range-speaker\">Apple just announced a new AirTag</a><span>&nbsp;that&nbsp;<a href=\"https://www.apple.com/shop/buy-airtag/airtag\" target=\"_blank\">costs $29</a>&nbsp;and still lacks a lanyard hole, meaning you’ll still need an accessory to attach it to anything</span>. We’ll be testing it soon, but the key updates include a second-gen UWB chip for improved Precision Finding, helping you locate items from “50 percent farther away” using haptic, visual, and audio signals. It also features an upgraded Bluetooth chip that further expands its tracking range, along with an updated speaker that’s supposedly twice as loud.</p>\n\n<h5 class=\"wp-block-heading\" id=\"SDsfpL\"><a href=\"https://www.theverge.com/2021/4/22/22396693/apple-airtag-location-tracker-hands-on-find-my-privacy-safety\">Read our original AirTags review</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"lIWi5H\">The best Bluetooth tracker for Android users</h2>\n<div class=\"product-block\"><h3>Tile Pro</h3>\n<div class=\"product-description\">The Tile Pro is the company’s loudest Bluetooth tracker and has the widest range at 400 feet. It also has a user-replaceable battery, unlike other Tiles.</div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/247416_Bluetooth_trackers_BG_AKrales_0044.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Tile-Life360-Pro-Bluetooth-Compatible/dp/B0D637HWC5/?th=1\"> $34.99 at <strong>Amazon</strong></a></li><li><a href=\"https://www.bestbuy.com/product/tile-by-life360-life360-tile-pro-powerful-bluetooth-tracker-key-finder-and-item-locator-ios-android-compatible-1-pack-black/J3YXKR5R4R\"> $34.99 at <strong>Best Buy</strong></a></li><li><a href=\"https://www.target.com/p/tile-by-life360-pro/-/A-91700381#lnk=sametab\"> $34.99 at <strong>Target</strong></a></li></ul></div>\n<p>More and more trackers now support both Google’s and Apple’s Find My networks, but Tile’s trackers — especially the $34.99 <a href=\"https://go.skimresources.com/?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Fwww.tile.com%2Fproduct%2Fblack-pro&amp;xcust=__vg0626awD__23533881__________________platform.theverge.com\">Tile Pro</a> — are still our top recommendation for Android users or mixed iOS / Android households. Functionally, the platform-agnostic trackers can do just about anything an AirTag can. Like AirTags, <a href=\"https://www.theverge.com/2021/5/7/22424837/tile-amazon-sidewalk-support-release-date-2021-bluetooth-tracking-airtags\">Tile devices can tap into a larger network</a> — in this case, the <a href=\"https://support.thetileapp.com/hc/en-us/articles/204315768-Tile-Network\">Tile Network</a> and Amazon Sidewalk — to help you find your devices outside of your phone’s Bluetooth range. While this network isn’t as expansive as Apple’s or Google’s, Amazon Sidewalk’s coverage has <a href=\"https://www.theverge.com/2023/3/28/23659191/amazon-sidewalk-network-coverage\">improved significantly</a>. When we <a href=\"https://www.theverge.com/google/655319/google-find-my-device-smart-tag-network-one-year-later\">tested Google’s Find Hub-compatible trackers</a> — including the Chipolo Pop, Pebblebee Clip 5, and the <a href=\"https://www.theverge.com/2024/6/25/24185612/motorola-moto-tag-android-find-my-device\">Moto Tag</a> — we found that Tile still did better at tracking items outside the home. </p>\n\n<p>Unfortunately, Tile still can&#8217;t do true real-time tracking, and it still doesn’t offer a tracker with UWB, so it lacks the AirTag’s precision tracking. The company <a href=\"https://www.theverge.com/2021/10/12/22716870/tile-ultra-bluetooth-tracker-uwb-ar-early-2022\">announced</a> one back in 2021, but we’re still waiting, partly because Apple is <a href=\"https://www.judiciary.senate.gov/imo/media/doc/04.21.21%20Kirsten%20Daru%20Senate%20Judiciary%20Testimony%20Final.pdf\">effectively blocking UWB compatibility</a> for third parties in iOS and because <a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/phones-accessories/tile-ultra-key-finder-release-date-what-happened-b2214979.html\">Tile’s priorities shifted</a> once it was <a href=\"https://www.theverge.com/2021/11/22/22797559/tile-bluetooth-tracker-location-gps-acquisition-life360\">acquired by Life360</a>. </p>\n\n<div class=\"wp-block-vox-media-highlight vox-media-highlight\">\n<h2 class=\"wp-block-heading\" id=\"a-note-about-google-s-find-hub-network-1\">A note about Google’s Find Hub network</h2>\n\n\n\n<p class=\"has-text-align-none\">In 2024,  Google finally&nbsp;<a href=\"https://www.theverge.com/2024/4/8/24124174/android-find-my-device-network-offline-tracker-tag-chipolo-pebblebee\">launched its Find My Device network</a>, which&nbsp;<a href=\"https://www.theverge.com/news/665754/google-uwb-find-hub-rebrand-find-my-device-moto-tag\">was later renamed Find Hub</a>.&nbsp;It works similarly to Apple’s Find My network: you’ll be able to share trackers with family members, and there are also unwanted tracking alerts.</p>\n\n\n\n<p class=\"has-text-align-none\">Initially, the network lagged behind Apple’s, but it’s starting to catch up. After <a href=\"https://www.theverge.com/google/655319/google-find-my-device-smart-tag-network-one-year-later\">several weeks of testing Find Hub-compatible trackers</a> — specifically the Chipolo Pop, Pebblebee Clip 5, and <a href=\"https://www.theverge.com/2024/6/25/24185612/motorola-moto-tag-android-find-my-device\">Moto Tag</a> — in April, we found the network had improved significantly over the past year or so, especially in busy areas. Still, it’s clear Google prioritized privacy over precision.</p>\n\n\n\n<p class=\"has-text-align-none\">Google is making some progress, though. In May, Google <a href=\"https://www.theverge.com/news/665754/google-uwb-find-hub-rebrand-find-my-device-moto-tag\">added UWB support</a>&nbsp;for more precise tracking with Motorola’s&nbsp;Moto Tag&nbsp;and, eventually, other compatible phones and trackers. Google <a href=\"https://support.google.com/accounts/answer/16490173\">also rolled out satellite connectivity to Pixel 9 phones</a> and newer devices in August, with the ability to&nbsp;<a href=\"https://www.theverge.com/news/665776/google-adds-tracker-sharing-with-airlines\">share tracker locations with airline staff</a>&nbsp;coming soon.</p>\n</div>\n\n<p>That said, Life360’s acquisition has brought some meaningful upgrades. Pressing a Tile button three times now sends an SOS alert to emergency contacts through Life360. You can also add others to your Circle so they can view and ring nearby Tiles on a shared Life360 map.&nbsp;More recently, Tile trackers <a href=\"https://www.theverge.com/news/675912/tile-bluetooth-trackers-fully-integrated-with-life360-app\">have become fully integrated</a> into Life360, letting users manage their trackers directly within the Life360 app. This merger unlocked a few premium features for free, including push alerts for forgotten items and two-day location history.</p>\n\n<p>Still, most of the good stuff — like 30-day location history, unlimited sharing with friends and family, free replacements for damaged Tiles, and up to $100 reimbursement for lost items — sits behind a $29.99/year subscription. Fortunately, Tile offers new members a one-year trial, and a single subscription covers all your devices. You also still get a lot of core functionality without paying: you can find your Tile via Bluetooth, view its last known location on a map, ring your phone from the Tile, and share access with one other person for free.</p>\n\n<p>Tile also stands out for its versatility. While AirTags come in a single puck-like design, Tile offers four distinct form factors to suit different needs. The card-shaped <a href=\"https://www.life360.com/tile-trackers/product/black-slim\">Tile Slim</a> ($29.99), for example, is the best option if you’re constantly losing your wallet. The square <a href=\"https://www.life360.com/tile-trackers/product/black-mate\">Tile Mate</a> ($24.99) comes with a hole so you can stick it on a key ring or carabiner, and is probably the most versatile. The $24.99 <a href=\"https://www.life360.com/tile-trackers/product/black-sticker\">Tile Sticker</a>, meanwhile, is a small disc that comes with a sticky backing so you can put it on remotes, pet collars, and anything else you can stick it on.</p>\n\n<p>The best Tile will depend on what you’re looking to track. My personal favorite, however, is the $34.99 <a href=\"https://www.life360.com/tile-trackers/product/black-pro\">Tile Pro</a>, which is shaped like a key fob, is larger than the Mate, and can also be attached to other items. Of the four, it has the longest Bluetooth range at 500 feet and the loudest ring. It’s also the only one that has a replaceable one-year CR2032 battery.&nbsp;</p>\n<img alt=\"Back of Tile tracker with QR code\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24746419/DSC00034.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"Back of Tile tracker with QR code\" />\n<p class=\"has-text-align-none\">Last but not least, Tile may actually be better than AirTags for tracking stolen items.&nbsp;The company rolled out an <a href=\"https://www.theverge.com/2023/2/17/23603989/tile-location-tracker-anti-theft-mode\">anti-theft feature</a> in 2023, which renders Tile devices invisible to unwanted tracking detection in the event someone steals your item. Just know that to use it, Tile requires you to submit a government ID for verification, agree to Tile working with law enforcement without a subpoena, and consent to a $1 million fine if you misuse this feature. For anti-stalking measures, Tile also has a “<a href=\"https://go.skimresources.com/?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Fwww.tile.com%2Fen-us%2Fblog%2Ftile-introduces-scan-and-secure-feature-unwanted-tracking-safety&amp;xcust=__vg0626awD__23533881__________________\">Scan and Secure</a>” feature, which allows you to use the Tile app to scan for unknown Tile devices in your vicinity. While better than nothing, it’s a flawed measure, as it requires the potential victim to proactively scan their surroundings.<strong>&nbsp;</strong></p>\n\n<h2 class=\"wp-block-heading\" id=\"the-best-airtag-and-tile-alternative\">The best AirTag and Tile alternative</h2>\n<div class=\"product-block\"><h3>Pebblebee Clip 5</h3>\n<div class=\"product-description\">The Pebblebee Clip 5 supports Apple’s Find My and Google’s Find Hub networks, but also has a 500-foot Bluetooth range, LEDs that flash to help you locate it, and a rechargeable battery that lasts up to 12 months on a single charge.</div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/11/pebblebee1.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://pebblebee.com/products/clip-5\"> $34.99 at <strong>Pebblebee</strong></a></li><li><a href=\"https://www.amazon.com/Pebblebee-Clip-Rechargeable-Bluetooth-Alternative/dp/B0FVYDKJBL\"> $34.99 at <strong>Amazon</strong></a></li></ul></div>\n<p>If you’re looking for an AirTag or Tile alternative, the <a href=\"https://www.amazon.com/Pebblebee-Clip-Rechargeable-Bluetooth-Alternative/dp/B0FVYDKJBL\">$34.99 Pebblebee Clip 5</a> is an excellent choice. It’s one of a growing number of trackers that support both Apple’s Find My and Google’s Find Hub networks, which is a major improvement over its predecessor. Setup is seamless for iOS and Android users, but because Pebblebee’s app doesn’t handle tracking, features like geofencing and safe locations depend on which network you choose. Apple’s Find My, for instance, supports “left behind” alerts and safe locations; Google’s Find Hub still lacks an equivalent.</p>\n\n<p>The thing I like best about the Pebblebee Clip 5 is its rechargeable battery. It can last up to a year on a single charge, though you may get longer than that depending on your usage. It features a USB-C port, and Pebblebee advertises a Bluetooth range of up to 500 feet, which is 100 feet more than the Tile Pro, our pick for Android users. Additionally, the Clip 5 features a blinking LED strip that’s noticeably brighter than prior models and a significantly louder ringtone, making lost items easier to find, even in dark or noisy environments.</p>\n\n<p>You can still use Pebblebee’s app to set voice tags, ask Amazon Alexa or Google Assistant for help, or double-tap the tracker to ring your phone. While the Clip 5 is larger than an AirTag, it also includes a snap-on key ring, so you don’t need to pay for an extra accessory just to attach it to your belongings. It’s also rated IP66 for dust and water resistance, making it slightly more durable than earlier Pebblebee trackers. ~ <em>Sheena Vasani, Commerce Writer</em></p>\n\n<h2 class=\"wp-block-heading\" id=\"2XTVy0\">The best AirTag alternatives for wallets</h2>\n<div class=\"product-block\"><h3>Pebblebee Card 5</h3>\n<div class=\"product-description\">The Pebblebee Card 5 has a rechargeable battery that lasts up to 18 months and supports wireless charging. It works with Apple’s Find My and Google’s Find Hub, but you can also use the Pebblebee app for voice tagging.</div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"166\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/pebblebeecard5.png?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Pebblebee-Card-Rechargeable-Eco-Friendly-Alternative/dp/B0FVYDTHZ3\"> $34.99 at <strong>Amazon</strong></a></li><li><a href=\"https://pebblebee.com/products/card-5\"> $34.99 at <strong>Pebblebee</strong></a></li></ul></div>\n<p>You could try stuffing an AirTag into a bifold wallet and hope it stays put — or opt for a Find My–compatible alternative that’s actually designed for wallets, like the <a href=\"https://www.amazon.com/Pebblebee-Card-Rechargeable-Eco-Friendly-Alternative/dp/B0FVYDTHZ3\">$34.99 Pebblebee Card 5</a>. It plays nicely with both Apple’s Find My and Google’s Find Hub networks, giving you cross-platform flexibility and the benefits of each, all with a super loud ringtone. It doesn’t offer precision tracking because it lacks UWB, but it makes up for it with said ringtones. It also <a href=\"https://support.apple.com/en-us/HT212227\">supports unwanted tracking alerts</a> as part of the Find My network.</p>\n\n<p>The Card 5 stands out for its sleek design and wireless charging. At just 1.8mm thick, it’s one of the thinnest trackers you can buy and measures about the size of a credit card, meaning you can easily slip it into an overstuffed wallet packed to the brim with receipts, gift cards, and cash. The same can’t always be said of Tile’s wallet tracker, which is nearly twice as thick. What’s more, the Card 5 lasts up to 18 months on a single charge and supports wireless charging, so you don’t have to worry about replacing any batteries.</p>\n\n<p>Unsurprisingly, the Card 5 shares many of the same strengths as the Pebblebee Clip 5, including support for the Pebblebee app and voice tagging. You also get a range of up to 500 feet, an IP66 rating for dust and water resistance, and a built-in button you can press to help locate your phone. ~ <em>Sheena Vasani, Commerce Writer</em></p>\n\n<h2 class=\"wp-block-heading\" id=\"other-bluetooth-trackers-to-consider\">Other Bluetooth trackers to consider</h2>\n\n<h3 class=\"wp-block-heading has-text-align-none\" id=\"chipolo-pop-and-chipolo-loop\"><a href=\"https://chipolo.net/en-us/products/chipolo-pop\">Chipolo Pop</a> and Chipolo Loop</h3>\n\n<p class=\"has-text-align-none\">The $29 <a href=\"https://chipolo.net/en-us/products/chipolo-pop\">Chipolo Pop</a> offers a similar form factor to Apple’s AirTag in a lighter, more colorful package with a hole for a keychain or lanyard, a louder beep, and compatibility with both Apple’s Find My and Google’s Find Hub networks (though only one at a time). You can even use the Pop as a remote camera shutter and press the built-in button twice to find your lost phone. Unlike Chipolo’s other trackers, it boasts a wider 300-foot Bluetooth range, a more robust IP55 rating for water and dust resistance, and includes a user-replaceable battery that can last up to a year.</p>\n\n<p class=\"has-text-align-none\">In my testing, tracking was accurate on both Apple’s and Google’s networks in most cases, Google’s struggled to track items outside my home as reliably as the Tile. And without UWB, the Pop couldn’t match the AirTag’s pinpoint precision. Still, the Chipolo app provides Android users with reliable out-of-range alerts and left-behind notifications — something Pebblebee and Moto Tag’s trackers lack —which, in my experience, triggered even faster than the AirTag and Tile. </p>\n\n<p class=\"has-text-align-none\">If you’re willing to spend an extra $10, the $39 <span><a href=\"https://chipolo.net/en-us/products/chipolo-loop\" target=\"_blank\">Chipolo Loop</a></span> is very similar to the Chipolo Pop, with many of the same strengths and weaknesses. However, it charges via USB-C and includes a built-in silicone ring that’s easy to attach to keys, bags, and other items. You also get a more durable IP67 rating and an extra 100 feet of Bluetooth range — up to 400 feet total. Just note you’ll have to supply your own USB-C cable. <em>~ Sheena Vasani, Commerce Writer</em></p>\n\n<h3 class=\"wp-block-heading has-text-align-none\" id=\"samsung-smarttag2\"><a href=\"https://www.amazon.com/SAMSUNG-SmartTag2-Bluetooth-Tracker-Tracking/dp/B0CCBXRYRC\"><strong>Samsung SmartTag2</strong></a></h3>\n\n<p class=\"has-text-align-none\">If you’re a Samsung Galaxy phone user, the $29.99 <a href=\"https://www.amazon.com/SAMSUNG-SmartTag2-Bluetooth-Tracker-Tracking/dp/B0CCBXRYRC\">Samsung SmartTag2</a> gets you UWB tracking and can tap into the Galaxy Find network, which operates similarly to Apple’s Find My network. It’s a great AirTag alternative but isn’t our overall pick for Android because it’s limited to Samsung Galaxy users. But for Samsung users, the latest SmartTag2 includes an improved Compass View, longer battery life, and a better app experience. It also has a newer, oblong design with a larger key ring than the original SmartTag.</p>\n\n<h3 class=\"wp-block-heading has-text-align-none\" id=\"moto-tag\"><a href=\"https://www.motorola.com/us/en/p/motoaccessories/all-moto-tags/pg38c06068?srsltid=AfmBOoq-TPEAHB7mhl4zO8IFef_alHrXhpxrtG7eAzpQ6B2buVqdXSr6&amp;pn=PG38C06069\">Moto Tag</a></h3>\n\n<p class=\"has-text-align-none\">Motorola’s $29.99 <a href=\"https://www.motorola.com/us/en/p/motoaccessories/all-moto-tags/pg38c06068?srsltid=AfmBOoq-TPEAHB7mhl4zO8IFef_alHrXhpxrtG7eAzpQ6B2buVqdXSr6&amp;pn=PG38C06069\">Moto Tag</a> is the first tracker on Google’s Find Hub network to offer ultra wideband for locating lost items on phones equipped with a UWB chip, which is a feature Google only recently enabled via a firmware update. Like Apple’s AirTag, it can guide you directly to your missing item via directional cues in the Find Hub app. It worked well in my testing, helping me find the exact location of nearby items in my small apartment, though Apple’s AirTag was occasionally more precise when tracking objects farther away or through walls. The Moto Tag was also less effective than Tile’s trackers at locating items outside my home.</p>\n\n<p class=\"has-text-align-none\">Still, if you want a tracker to find things around the house, the Moto Tag is a solid pick. It also fits most AirTag accessories, carries an IP67 rating for dust and water resistance, and uses a replaceable CR2032 battery that lasts up to a year. It can ring your misplaced phone, too, and doubles as a remote shutter for Motorola phones. <em>~ Sheena Vasani, Commerce Writer</em></p>\n\n<h3 class=\"wp-block-heading has-text-align-none\" id=\"chipolo-card\"><strong><a href=\"https://chipolo.net/en-us/products/chipolo-card\">Chipolo Card</a></strong></h3>\n\n<p class=\"has-text-align-none\">The rechargeable <a href=\"https://chipolo.net/en-us/products/chipolo-card\">Chipolo Card</a> is also a good tracker for wallets. Priced at $39, it works with either Apple’s Find My or Google’s Find Hub network and carries an IP67 rating for dust and water resistance. It supports Qi wireless charging, unlike the Chipolo Loop, and features a slim design that slips neatly into your wallet. It also offers a 400-foot Bluetooth range — a bit less than the Pebblebee Card 5 — and lasts about six months per charge. Overall, it’s a solid choice if you want something simple, even if it lacks the QR code found on some competing trackers.  ~ <em>Sheena Vasani, Commerce Writer</em></p>\n\n<h3 class=\"wp-block-heading has-text-align-none\" id=\"eufy-security-smarttrack-card-e30\"><a href=\"https://www.amazon.com/eufy-SmartTrack-Rechargeable-Bluetooth-Resistant/dp/B0DDL6D7L8\"><strong>Eufy Security SmartTrack Card</strong> E30</a></h3>\n\n<p class=\"has-text-align-none\">Eufy’s rechargeable $34.99 <a href=\"https://www.amazon.com/eufy-SmartTrack-Rechargeable-Bluetooth-Resistant/dp/B0DDL6D7L8\">SmartTrack Card E30</a> is another good option for wallets, one that offers the same Find My network benefits as the aforementioned Pebblebee Card 5. On the back, there’s also a QR code — similar to the ones Tile uses — that helps good Samaritans return your item to you. Like the Pebblebee’s newest offerings, you can share it with multiple people if you set it up via the Eufy Security app. The bummer here is that it doesn’t work with Android and lacks UWB.</p>\n\n<h2 class=\"wp-block-heading\" id=\"what-s-coming-next\">What’s coming next</h2>\n\n<ul class=\"wp-block-list\">\n<li>Announced at CES, the forthcoming <a href=\"https://www.theverge.com/gadgets/850486/anker-eufy-smarttrack-card-e40-bluetooth-tracker-ces-2026\">Eufy SmartTrack Card E40</a> is the successor to the SmartTrack Card E30. At just 1.7mm thick, it’ll be thinner than the Pebblebee Card 5 and noticeably slimmer than the E30. The E40 will also add support for Google’s Find Hub network alongside Apple’s Find My network, making it a more flexible option than its predecessor. It recharges via any Qi-compatible wireless charger and features a louder, 100dB alarm. Priced at $34.99, the tracker is expected to arrive in Q1 2026.</li>\n\n\n\n<li><a href=\"https://www.theverge.com/news/781945/ugreen-finetrack-slim-smart-g-bluetooth-tracker-battery-life\">Ugreen recently released</a> the <a href=\"https://www.amazon.com/UGREEN-FineTrack-Bluetooth-Waterproof-Ultra-Slim/dp/B0FBWBDB1Q/\">$25.99 FineTrack Slim Smart G</a>, which, at just 1.7mm thick, is slimmer than the 2.5mm Tile Slim. Ugreen claims the tracker can last up to five years, but since it lacks charging capabilities and a replaceable battery, you’ll need to replace it entirely once it dies. It also works with Google’s Find Hub network and offers IP68 dust and waterproofing.</li>\n</ul>\n\n<p class=\"has-text-align-none\"><em><strong>Update, January 26th: </strong>Adjusted pricing / availability and added the Pebblebee Clip 5, Pebblebee Card 5, and Chipolo Card to our list of recommendations. We also mentioned Apple’s latest AirTag and removed a pair of former Chipolo picks</em>.</p>",
      "author": "Victoria Song",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "5b969fc8-19e0-494c-801a-7ca19cf8ffaf",
      "title": "OpenAI’s president is a Trump mega-donor",
      "link": "https://www.theverge.com/ai-artificial-intelligence/867947/openai-president-greg-brockman-trump-super-pac",
      "published": "2026-01-26T19:57:08+00:00",
      "summary": "OpenAI's co-founder and longtime president, Greg Brockman, didn't just make a run-of-the-mill donation to the main pro-Trump super PAC - together, he and his wife Anna's September 2025 donations equaled the largest of them all, totaling $25 million to \"MAGA Inc.,\" per a recent filing. The Brockmans' donations made up nearly one-fourth of the six-month [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268281_OpenAIs_president_is_a_Trump_mega-donor_CVirginia.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">OpenAI's co-founder and longtime president, Greg Brockman, didn't just make a run-of-the-mill donation to the main pro-Trump super PAC - together, he and his wife Anna's September 2025 donations equaled the largest of them all, totaling $25 million to \"MAGA Inc.,\" per a <a href=\"https://docquery.fec.gov/cgi-bin/forms/C00892471/1930534/\">recent filing</a>. The Brockmans' donations made up nearly one-fourth of the six-month fundraising cycle. </p>\n<p class=\"has-text-align-none\">It's the latest in a string of examples of tech executives cozying up to President Trump's administration, happening as the administration pushes to aggressively back the AI industry and defang state-level regulations that companies like OpenAI have largely opposed. OpenAI  …</p>\n<p><a href=\"https://www.theverge.com/ai-artificial-intelligence/867947/openai-president-greg-brockman-trump-super-pac\">Read the full story at The Verge.</a></p>",
      "author": "Hayden Field",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "d816b172-38ed-48c3-8f36-9227a07275a9",
      "title": "Google will settle its Assistant spying lawsuit for $68 million",
      "link": "https://www.theverge.com/news/868078/google-assistant-lawsuit-settlement",
      "published": "2026-01-26T19:45:53+00:00",
      "summary": "Google could owe you some money, now that it's moving to settle a class-action lawsuit over how it handled recordings captured when its devices were activated by something other than Google Assistant's actual trigger word, \"Ok Google.\" German outlet VRT NWS's 2019 report exposed the issue, and court filings from last Friday say the proposed [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/19482921/acastro_180510_1777_google_assistant_0001.0.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Google could owe you some money, now that it's moving to settle a class-action lawsuit over how it handled recordings captured when its devices were activated by something other than Google Assistant's actual trigger word, \"Ok Google.\" German outlet <a href=\"https://www.theverge.com/2019/7/11/20690020/google-assistant-home-human-contractors-listening-recordings-vrt-nws\"><em>VRT NWS</em>'s 2019 report</a> exposed the issue, and court filings from last Friday say the proposed settlement number is $68 million, as reported previously by <a href=\"https://www.reuters.com/sustainability/boards-policy-regulation/google-settles-google-assistant-privacy-lawsuit-68-million-2026-01-26/\"><em>Reuters</em></a>.  </p>\n<p class=\"has-text-align-none\">The <a href=\"https://www.googleassistantprivacylitigation.com/Home/Contact\">lawsuit</a> accuses Google of \"unlawful and intentional recording of individuals' confidential communications without their consent,\" during these \"False Accepts.\" <em>VRT NWS</em> reported that human workers <a href=\"https://www.theverge.com/2019/7/11/20690020/google-assistant-home-human-contractors-listening-recordings-vrt-nws\">who analyzed Assistant audio clips</a> …</p>\n<p><a href=\"https://www.theverge.com/news/868078/google-assistant-lawsuit-settlement\">Read the full story at The Verge.</a></p>",
      "author": "Stevie Bonifield",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "e4f583b1-5f0d-485a-8bc3-bba335518ce3",
      "title": "Apple’s luxe AirPods Max have dropped to one of their lowest prices ever",
      "link": "https://www.theverge.com/gadgets/868017/apple-airpods-max-usb-c-best-buy-flash-deal-sale",
      "published": "2026-01-26T19:38:39+00:00",
      "summary": "If you prefer over-ear headphones to earbuds and own an iPhone or another Apple device, the AirPods Max with USB-C are worth a look, especially now that you can buy them at Best Buy as part of a flash deal for $429.99 ($120 off) through tomorrow, January 27th. That’s $30 shy of their lowest price [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/Sleeping_on_AirPods_Max.webp?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tAll colors are on sale right now, including the attractive blue shade.\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">If you prefer over-ear headphones to earbuds and own an iPhone or another Apple device, the <strong>AirPods Max with USB-C </strong>are worth a look, especially now that you can buy them <a href=\"https://www.bestbuy.com/product/apple-airpods-max-usb-c-midnight/JJGCQ3ZZ3Q\">at Best Buy</a> as part of a flash deal for $429.99 ($120 off) through tomorrow, January 27th. That’s $30 shy of their lowest price to date, and a notable deal given these over-ears don’t often drop below $449.99 outside of big sales events.</p>\n<div class=\"product-block\"><h3>AirPods Max (USB-C)</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/airpodsmaxusbcpink.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.bestbuy.com/site/apple-airpods-max-usb-c-midnight/6550076.p\"> <strike>$549.99</strike> $429.99 at <strong>Best Buy</strong></a></li><li><a href=\"https://www.walmart.com/ip/AirPods-Max-Midnight/11378018200\"> <strike>$549</strike> $449.99 at <strong>Walmart</strong></a></li><li><a href=\"https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJC52FP/\"> <strike>$549</strike> $449.99 at <strong>Amazon</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">The AirPods Max stand out thanks to their premium design, which uses premium materials like aluminum, steel, and fabric that feel more high-end than plastic rivals from <a href=\"https://www.amazon.com/Sony-WH-1000XM6-Headphones-Microphones-Studio-Quality/dp/B0F3PQHWTZ\">Sony</a> and <a href=\"https://www.amazon.com/Bose-QuietComfort-Bluetooth-Headphones-Cancelling/dp/B0FDKQZ18F\">Bose</a>. They’re also one of the few pairs of over-ear headphones designed to work seamlessly with Apple gadgets, thanks to features like automatic device switching and hands-free Siri access. Additionally, they can tap into Apple’s Find My network and the company’s nifty audio sharing feature, which lets two pairs of AirPods or Beats headphones listen from a single iPhone or iPad.</p>\n\n<p class=\"has-text-align-none\">In terms of audio, the AirPods Max deliver well-balanced, natural sound with <a href=\"https://www.theverge.com/news/634506/apple-airpods-max-lossless-audio-low-latency-usb-c\">support for 24-bit / 48kHz lossless audio playback</a> over USB-C, so you can listen to compatible songs with better detail and clarity. They also continue to deliver top-tier noise cancellation, support ultra-low latency audio, and feature a clear transparency mode, making them a great all-around option for Apple users.</p>",
      "author": "Sheena Vasani",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "dfbffdb4-cdfd-4a90-9dc9-95f0ac97686a",
      "title": "Even the big dick subreddit is mad about ICE",
      "link": "https://www.theverge.com/news/867967/ice-shooting-minneapolis-reddit-communities-activism",
      "published": "2026-01-26T18:31:13+00:00",
      "summary": "\"Fuck ICE first, second, third, and fourth. Then worry about fucking me,\" a Reddit post reads. \"Immigrants of any status are my friends, neighbors, and colleagues.\" Across the internet - and in the streets - the sentiment is unavoidable, especially after a federal immigration agent shot and killed Alex Pretti, a 37-year-old nurse, in Minneapolis [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268279_r_MassiveCock_welcome_to_the_resistance_CVirginia23.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">\"Fuck ICE first, second, third, and fourth. Then worry about fucking me,\" a Reddit post reads. \"Immigrants of any status are my friends, neighbors, and colleagues.\" </p>\n<p class=\"has-text-align-none\">Across the internet - <a href=\"https://www.theverge.com/policy/867410/minneapolis-ice-protest-alex-pretti-killing\">and in the streets</a> - the sentiment is unavoidable, especially after a federal immigration agent <a href=\"https://www.theverge.com/news/867245/ice-has-killed-another-person-in-minneapolis\">shot and killed Alex Pretti</a>, a 37-year-old nurse, in Minneapolis on Saturday. The killing came just weeks after an immigration agent shot and killed another person, Renee Good, who <a href=\"https://www.theverge.com/tech/858710/minneapolis-ice-shooting-trump-video-footage-social-media\">federal officials smeared</a> as a \"domestic terrorist\" with no evidence. This Reddit post's message would fit right in in online spaces for <a href=\"https://www.theverge.com/policy/867451/creators-and-communities-take-a-stand-against-ice\">countless hobbies, interests, and creators</a>: an …</p>\n<p><a href=\"https://www.theverge.com/news/867967/ice-shooting-minneapolis-reddit-communities-activism\">Read the full story at The Verge.</a></p>",
      "author": "Mia Sato",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "406a75d1-311e-478a-b56d-d5b0e0ba7bac",
      "title": "Tattle TV has turned a Hitchcock classic into a vertical video ‘microdrama’",
      "link": "https://www.theverge.com/entertainment/867844/tattle-tv-the-lodger-hitchcock",
      "published": "2026-01-26T18:00:29+00:00",
      "summary": "Most vertical video microdrama apps have been focused on putting out newly produced series meant to be watched on your phone. But Tattle TV thinks that people might also be interested in checking out bite-size pieces of cinematic history. Though Tattle TV - a UK-based streaming platform created by filmmakers Philip McGoldrick and Marina Elderton [&#8230;]",
      "content": "<figure>\n\n<img alt=\"A blonde woman with a bob.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/Screenshot-2026-01-26-at-10.35.42%E2%80%AFAM.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Most <a href=\"https://www.theverge.com/column/821345/micro-dramas-how-hollywood\">vertical video microdrama apps</a> have been focused on putting out newly produced series meant to be watched on your phone. But Tattle TV thinks that people might also be interested in checking out bite-size pieces of cinematic history.</p>\n<p class=\"has-text-align-none\">Though Tattle TV - a UK-based streaming platform created by filmmakers Philip McGoldrick and Marina Elderton - features <a href=\"https://www.instagram.com/reel/DRusik7CGcw/\">a reality dating series about dog owners</a> and a modern drama <a href=\"https://www.youtube.com/watch?v=Ei9o1vjqBHo\">about a female MMA fighter</a>, the company's latest debut is a vertically oriented edit of Alfred Hitchcock's silent film <em>The Lodger: A Story of the London Fog</em>. </p>\n<p class=\"has-text-align-none\">Similar to other microdrama apps, Tattle TV splits all of its content …</p>\n<p><a href=\"https://www.theverge.com/entertainment/867844/tattle-tv-the-lodger-hitchcock\">Read the full story at The Verge.</a></p>",
      "author": "Charles Pulliam-Moore",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "f6143d14-a236-4df4-bf7f-4325af11f5b4",
      "title": "MCP unites Claude chat with apps like Slack, Figma, and Canva",
      "link": "https://www.theverge.com/news/867673/claude-mcp-app-interactive-slack-figma-canva",
      "published": "2026-01-26T18:00:00+00:00",
      "summary": "Anthropic's Claude got a bit livelier today thanks to a new extension to MCP, the open-source protocol that allows AI agents to easily access tools and data across the internet. Users will now be able to interact with apps directly inside the Claude chatbot, letting you draft and format Slack messages to colleagues and create [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/STKB364_CLAUDE_2_C_96d15c.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Anthropic's Claude got a bit livelier today thanks to a new extension to MCP, the open-source protocol that allows AI agents to easily access tools and data across the internet. Users will now be able to interact with apps directly inside the Claude chatbot, letting you draft and format Slack messages to colleagues and create presentations for clients in Canva without having to switch tabs.</p>\n<p class=\"has-text-align-none\">As of today, Anthropic said tools like Asana, Figma, Slack, and Canva will \"open as interactive apps right inside of chat.\" While users could previously connect tools like Slack and Asana to the AI assistant, doing so meant getting text back. The company …</p>\n<p><a href=\"https://www.theverge.com/news/867673/claude-mcp-app-interactive-slack-figma-canva\">Read the full story at The Verge.</a></p>",
      "author": "Robert Hart",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "a2ea6243-2382-41e5-ba70-db658143aa23",
      "title": "TikTokers are heading to UpScrolled following US takeover",
      "link": "https://www.theverge.com/news/867958/tiktok-upscrolled-app-us-takeover",
      "published": "2026-01-26T17:47:31+00:00",
      "summary": "TikTok's takeover in the US has prompted users to join an alternative social platform called UpScrolled. The app, which is available on Android and iOS, currently holds the 12th spot in Apple's App Store, and it's struggling to keep up with an influx of new traffic. \"You showed up so fast our servers tapped out,\" [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/upscrolled.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">TikTok's takeover in the US has prompted users to join an alternative social platform called UpScrolled. The app, which is available on <a href=\"https://play.google.com/store/apps/details?id=com.upscrolled.app&amp;hl=en_US\">Android</a> and <a href=\"https://apps.apple.com/us/app/upscrolled/id6746533451\">iOS</a>, currently <a href=\"https://apps.apple.com/us/iphone/charts\">holds the 12th spot</a> in Apple's App Store, and it's struggling to keep up with an influx of new traffic.</p>\n<p class=\"has-text-align-none\">\"You showed up so fast our servers tapped out,\" UpScrolled <a href=\"https://x.com/realUpScrolled/status/2015797730241601808?s=20\">writes in a post on Bluesky</a>, adding that it's working to get things up and running. Data shared by Appfigures indicates that the app had been downloaded 41,000 times between Thursday and Saturday, while averaging about 14,000 downloads per day - 29 times more than the 460 daily downloads it averaged before TikTok's takeo …</p>\n<p><a href=\"https://www.theverge.com/news/867958/tiktok-upscrolled-app-us-takeover\">Read the full story at The Verge.</a></p>",
      "author": "Emma Roth",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "fe12d9ec-39b5-4f33-b4bf-ed2c479dbf8f",
      "title": "Internal chats show how social media companies discussed teen engagement",
      "link": "https://www.theverge.com/policy/867845/meta-youtube-snap-tiktok-social-media-trials-documents",
      "published": "2026-01-26T16:46:05+00:00",
      "summary": "Recently released documents show the big business opportunity that social media companies saw in recruiting teens to their platforms and how they discussed risks that heavy digital engagement could pose. The documents were released last week as part of a major set of trials brought by school districts, state attorneys general, and others against Meta, [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25332712/STK419_DEEPFAKE_CVIRGINIA_I.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Recently released documents show the big business opportunity that social media companies saw in recruiting teens to their platforms and how they discussed risks that heavy digital engagement could pose. </p>\n<p class=\"has-text-align-none\">The documents were released last week as part of a major set of trials brought by school districts, state attorneys general, and others against Meta, Snap, TikTok and YouTube, alleging the design of their products harmed young users. The Tech Oversight Project, which advocates for more regulations on tech platforms to safeguard teens online, compiled a <a href=\"https://techoversight.org/2026/01/25/top-report-mdl-jan-25/\">report</a> on the newly released documents, which were independently reviewed by <em>The Verge</em>.  …</p>\n<p><a href=\"https://www.theverge.com/policy/867845/meta-youtube-snap-tiktok-social-media-trials-documents\">Read the full story at The Verge.</a></p>",
      "author": "Lauren Feiner",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "1df123b6-a974-4f38-9aa9-b24ea6fb7246",
      "title": "OpenAI is working out how much to charge for ChatGPT ads",
      "link": "https://www.theverge.com/news/867898/openai-chatgpt-ad-pricing",
      "published": "2026-01-26T16:33:11+00:00",
      "summary": "OpenAI is reportedly asking a high price to advertise on ChatGPT, around $60 per 1,000 views, or triple what ads on Meta's platform usually cost, according to The Information. Despite the higher price, OpenAI won't be offering advertisers the same level of detailed information that Google and Meta do, such as whether users took any [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24390407/STK149_AI_02.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">OpenAI is reportedly asking a high price to advertise on ChatGPT, around $60 per 1,000 views, or triple what ads on Meta's platform usually cost, according to <a href=\"https://www.theinformation.com/articles/openai-seeks-premium-prices-early-ads-push?rc=v4bmzs\"><em>The Information</em></a>. </p>\n<p class=\"has-text-align-none\">Despite the higher price, OpenAI won't be offering advertisers the same level of detailed information that Google and Meta do, such as whether users took any action in response to seeing an ad on ChatGPT, like making a purchase. Early advertisers on ChatGPT will only get \"high-level\" data on how their ads perform, like total ad views or total clicks. </p>\n<p class=\"has-text-align-none\">OpenAI could give advertisers more details down the line, but when it <a href=\"https://www.theverge.com/news/863428/openai-chatgpt-shopping-ads-test\">announced ads in ChatGPT</a> earlier this month, O …</p>\n<p><a href=\"https://www.theverge.com/news/867898/openai-chatgpt-ad-pricing\">Read the full story at The Verge.</a></p>",
      "author": "Stevie Bonifield",
      "fetched_at": "2026-01-26T21:26:59.806088+00:00"
    },
    {
      "item_id": "6d34f570-e3a9-4e54-a491-4a0d988318c0",
      "title": "Creators and communities everywhere take a stand against ICE",
      "link": "https://www.theverge.com/policy/867451/creators-and-communities-take-a-stand-against-ice",
      "published": "2026-01-25T17:21:43+00:00",
      "summary": "It's not surprising when the guy who's been yelling about the horrors of late-stage capitalism on Instagram for the last five years turns his ire towards ICE. But something different has been happening over the week or so, following the most recent shootings of civilians by federal agents - even accounts that stay laser focused [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268278_After_Pretti_killed_SGarcia_0081.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">It's not surprising when the guy who's been yelling about the horrors of late-stage capitalism on Instagram for the last five years turns his ire towards ICE. But something different has been happening over the week or so, following the most recent shootings of civilians by federal agents - even accounts that stay laser focused on <a href=\"https://www.instagram.com/p/DTY4tESkRbS/\">golfing</a>, chopping wood, and playing cats like bongos have started to speak out. </p>\n<p class=\"has-text-align-none\">The tenor on social media and Reddit took an even sharper turn yesterday, following the <a href=\"https://www.theverge.com/news/867245/ice-has-killed-another-person-in-minneapolis\">killing of Alex Pretti</a> by ICE. Even the moderator of normally politics-free r/catbongos (a subreddit \"Where gentlemen, gentlewomen, and gentlethem …</p>\n<p><a href=\"https://www.theverge.com/policy/867451/creators-and-communities-take-a-stand-against-ice\">Read the full story at The Verge.</a></p>",
      "author": "Terrence O’Brien",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "70b03823-37d8-4ac3-8f4b-75948d9aa93b",
      "title": "It doesn’t matter if Alex Pretti had a gun",
      "link": "https://www.theverge.com/policy/867455/dhs-ice-border-patrol-minneapolis-alex-pretti",
      "published": "2026-01-25T17:01:38+00:00",
      "summary": "Shortly after federal agents killed Alex Pretti Saturday morning, the Department of Homeland Security began to run with the story that the dead man had been armed and dangerous. He had a gun, DHS said. (A Bellingcat analysis of the video concludes that Pretti was unarmed when he was shot.) He had approached the agents [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268257_Minneapolis_ICE_SGarcia_0033.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tFederal officers line up outside as demonstrators protest outside of the Whipple Federal Building on January 17th, 2026, in Minneapolis, Minnesota. Protests have ramped up around the Minneapolis / St. Paul metro area following the fatal shooting of Renee Good by an immigration enforcement agent during an incident in south Minneapolis on January 7th. | Photo by Steven Garcia / The Verge\t</figcaption>\n</figure>\n<p class=\"has-drop-cap has-text-align-none\">Shortly after federal agents killed <a href=\"https://www.startribune.com/alex-pretti-identified-as-man-fatally-shot-by-federal-officers-in-minneapolis/601570109\">Alex Pretti</a> Saturday morning, the Department of Homeland Security began to run with the story that the dead man had been armed and dangerous. He had a gun, DHS said. (A <a href=\"https://bsky.app/profile/bellingcat.com/post/3md6vleoxks2t\">Bellingcat analysis</a> of the video concludes that Pretti was unarmed when he was shot.) He had approached the agents holding the gun, DHS said. (He was holding a phone, <a href=\"https://www.nytimes.com/2026/01/24/us/minneapolis-shooting-federal-agents-video.html\"><em>The New York Times </em>reports</a>.) Pretti died on his knees, surrounded by armed Border Patrol agents, with shot after shot unloaded in his direction. </p>\n<p class=\"has-text-align-none\">America's Second Amendment is beloved by conservatives. Minnesota allows open carry with a permit. Pretti lived in a city where pe …</p>\n<p><a href=\"https://www.theverge.com/policy/867455/dhs-ice-border-patrol-minneapolis-alex-pretti\">Read the full story at The Verge.</a></p>",
      "author": "Sarah Jeong",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "47d29815-49a8-4e14-821e-4c19d0e93e9a",
      "title": "Trusting your phone to Abxylute’s mobile controller requires a big leap of faith",
      "link": "https://www.theverge.com/tech/864821/abxylute-m4-snap-on-mobile-controller-magsafe-magnetic-bluetooth",
      "published": "2026-01-25T16:00:00+00:00",
      "summary": "As a retro gaming fan, I was thrilled when Apple opened its App Store to emulators in 2024, but I've yet to find a controller that makes me want to fully embrace retro gaming on my phone. Clamp-on controllers like the Backbone Pro are a bit too bulky, and I don't want to prop my [&#8230;]",
      "content": "<figure>\n\n<img alt=\"An iPhone 16 Pro playing a TMNT game with the Abxylute M4 mobile controller attached.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/abxylute_m4_1.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tTurning your phone into a handheld with the M4 could be risky.\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">As a retro gaming fan, I was thrilled when <a href=\"https://www.theverge.com/2024/4/5/24122341/apple-app-store-game-emulators-super-apps\">Apple opened its App Store to emulators in 2024</a>, but I've yet to find a controller that makes me want to fully embrace retro gaming on my phone. </p>\n<p class=\"has-text-align-none\"><a href=\"https://www.theverge.com/games/661382/the-new-backbone-pro-could-be-the-one-controller-for-all-your-gaming\">Clamp-on controllers like the Backbone Pro</a> are a bit too bulky, and I don't want to prop my phone up somewhere to use a standalone gamepad. The Abxylute M4 seemed exactly what I was looking for when it <a href=\"https://www.theverge.com/news/809274/abxylute-m4-snap-on-mobile-wireless-smartphone-controller-magnetic-magsafe\">debuted a few months ago</a>. It's a compact wireless gamepad that uses a magnetic mount to attach to my iPhone. It's a clever design, but one that's let down by stiff thumbsticks and a magnetic mount that doesn't always feel like it's securely supporting my ph …</p>\n<p><a href=\"https://www.theverge.com/tech/864821/abxylute-m4-snap-on-mobile-controller-magsafe-magnetic-bluetooth\">Read the full story at The Verge.</a></p>",
      "author": "Andrew Liszewski",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "6692bac3-1d94-41ac-8d85-d097b90a2e43",
      "title": "Why won’t anyone stop ICE from masking?",
      "link": "https://www.theverge.com/policy/867202/ice-mask-ban-no-secret-police-california",
      "published": "2026-01-25T15:00:00+00:00",
      "summary": "Americans do not like masked secret police. There is really no other way to put it. The reasons why are manifold: accountability, trust in law enforcement, and just plain overall vibes. More concretely, not being able to tell who's a cop and who's not is dangerous. An assassin masquerading as law enforcement killed Minnesota legislator [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268266_unmasking_ICE__CVirginia.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Americans do not like masked secret police. There is really no other way to put it. The reasons why are manifold: accountability, trust in law enforcement, and just plain overall vibes. More concretely, not being able to tell who's a cop and who's not is dangerous. An assassin masquerading as law enforcement killed Minnesota legislator <a href=\"https://www.startribune.com/minnesota-house-leader-assassinated-state-senator-shot-in-political-violence-that-stuns-nation/601373094\">Melissa Hortman</a> and her husband last year. How is anyone supposed to tell whether <a href=\"https://www.mprnews.org/story/2026/01/20/chongly-scott-thao-says-ice-removed-him-from-home-in-his-underwear-after-warrantless-search\">they're being dragged out of their home in their underwear</a> by ICE or by mere amateur thugs?</p>\n<p class=\"has-text-align-none\">Last year, California passed the No Secret Police Act, which restricts masking for federal law enforcement, alongside the No Vigilantes  …</p>\n<p><a href=\"https://www.theverge.com/policy/867202/ice-mask-ban-no-secret-police-california\">Read the full story at The Verge.</a></p>",
      "author": "Sarah Jeong",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "74c92ce5-5a4d-4979-9e32-08ca7b177c6f",
      "title": "Sony’s first clip earbuds don’t quite hit the mark",
      "link": "https://www.theverge.com/tech/866975/sony-linkbuds-clip-open-earbuds-review",
      "published": "2026-01-25T14:00:00+00:00",
      "summary": "The Sony LinkBuds Clip are the company's first clip earbuds. They follow the innovative donut-hole LinkBuds and LinkBuds Open and, like their predecessors, allow you to listen to music or podcasts, make phone calls, or be active outdoors while still maintaining awareness of your surroundings. The clip design has become more popular over the past [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268260_Sony_Linkbuds_Clip_AKrales_0049.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tThe Sony LinkBuds Clip can be customized with different colored covers for the case.\t</figcaption>\n</figure>\n<p class=\"has-drop-cap has-text-align-none\">The Sony LinkBuds Clip are the company's first clip earbuds. They follow the innovative donut-hole <a href=\"https://www.theverge.com/22933521/sony-linkbuds-earbuds-review-features-specs\">LinkBuds</a> and <a href=\"https://www.theverge.com/2024/10/1/24256202/sony-linkbuds-open-fit-wireless-earbuds-headphones\">LinkBuds Open</a> and, like their predecessors, allow you to listen to music or podcasts, make phone calls, or be active outdoors while still maintaining awareness of your surroundings. The clip design has become more popular over the past couple of years, and while the LinkBuds Clip have a solid design and good sound, there's nothing significant that sets them apart from competitors, especially at their $229.99 price.</p>\n<p class=\"has-text-align-none\">Like other open earbuds, the LinkBuds Clip wrap around your ear helix like an ear cuff. The small spherical speaker e …</p>\n<p><a href=\"https://www.theverge.com/tech/866975/sony-linkbuds-clip-open-earbuds-review\">Read the full story at The Verge.</a></p>",
      "author": "John.Higgins",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "0f35739a-8930-4a6f-b553-df6215bc1e79",
      "title": "The great e-bike crackdown has begun",
      "link": "https://www.theverge.com/column/866218/e-bike-crackdown",
      "published": "2026-01-25T13:00:00+00:00",
      "summary": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the e-bike movement, follow Andrew J. Hawkins. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here. How it started Last week, I did something I don't typically do, which [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268262_Unnecessary_e-bike_restrictions_threaten_the_movement_CVirginia.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\"><em>This is </em><a href=\"https://www.theverge.com/the-stepback-newsletter\">The Stepback</a><em>, a weekly newsletter breaking down one essential story from the tech world. For more on the e-bike movement, follow <a href=\"https://www.theverge.com/authors/andrew-j-hawkins\">Andrew J. Hawkins</a>. </em>The Stepback<em> arrives in our subscribers' inboxes at 8AM ET. Opt in for </em>The Stepback <a href=\"https://www.theverge.com/newsletters\"><em>here</em></a><em>.</em></p>\n<h2 class=\"wp-block-heading has-text-align-none\">How it started</h2>\n<p class=\"has-text-align-none\">Last week, I did something I don't typically do, which is call up one of my elected officials and yell at them about a new bill. </p>\n<p class=\"has-text-align-none\">New Jersey's car-brained lawmakers had just passed legislation that would impose heavy restrictions on e-bike ownership in the state, and I was livid. Obviously there's been a lot of concern about the growing number of teenagers being injured and killed w …</p>\n<p><a href=\"https://www.theverge.com/column/866218/e-bike-crackdown\">Read the full story at The Verge.</a></p>",
      "author": "Andrew J. Hawkins",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "77c5b52e-1068-421f-ae70-926c16ba0c86",
      "title": "The day of the second killing",
      "link": "https://www.theverge.com/policy/867410/minneapolis-ice-protest-alex-pretti-killing",
      "published": "2026-01-25T02:00:00+00:00",
      "summary": "Steven Garcia, as told to Gaby Del Valle: I was in the middle of a frozen lake when I got the notification from The Minnesota Star Tribune that there had been a shooting. I was on assignment at a pond hockey event, and someone who was supposed to play later that evening said he probably [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/268278_After_Pretti_killed_SGarcia_0048.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\"><em>Steven Garcia, as told to Gaby Del Valle:</em></p>\n<p class=\"has-text-align-none\">I was in the middle of a frozen lake when I got the notification from <em>The</em> <em>Minnesota Star Tribune</em> that there had been a shooting. I was on assignment at a pond hockey event, and someone who was supposed to play later that evening said he probably wouldn't be able to make it - they knew there would be protests and demonstrations happening. </p>\n<p class=\"has-text-align-none\">I arrived a little over three hours later. Federal officers had already cleared the scene - the FBI had been there investigating - so the only law enforcement present were state and local officials: the Minneapolis Police Department, their SWAT team, the Hennepin  …</p>\n<p><a href=\"https://www.theverge.com/policy/867410/minneapolis-ice-protest-alex-pretti-killing\">Read the full story at The Verge.</a></p>",
      "author": "Gaby Del Valle",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "ee9cfd0d-5bf4-46fa-b909-3b42087ab759",
      "title": "Microsoft handed the government encryption keys for customer data",
      "link": "https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi",
      "published": "2026-01-24T22:39:57+00:00",
      "summary": "The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam - and Microsoft complied. Typically, companies resist handing over encryption keys to authorities. Most famously, [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/STK095_Microsoft_04.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam - and <a href=\"https://www.forbes.com/sites/thomasbrewster/2026/01/22/microsoft-gave-fbi-keys-to-unlock-bitlocker-encrypted-data/\">Microsoft complied</a>. </p>\n<p class=\"has-text-align-none\">Typically, companies resist handing over encryption keys to authorities. Most famously, <a href=\"https://www.theverge.com/2016/2/17/11036306/apple-fbi-iphone-encryption-backdoor-tim-cook\">Apple refused</a> to grant the FBI access to a phone used by the San Bernardino shooters in 2016. The FBI eventually found a third-party to hack their way into the phone, but ultimately <a href=\"https://www.theverge.com/2016/4/22/11492804/fbi-apple-new-york-iphone-unlocking-case-withdrawl\">withdrew</a> its case. Most of the major tech companies, including <a href=\"https://www.theverge.com/2016/2/17/11040266/google-ceo-sundar-pichai-sides-with-apple-encryption\">Google</a> and <a href=\"https://www.theverge.com/2016/2/18/11056074/apple-iphone-encryption-fbi-facebook-twitter-support\">Facebook</a> backed Apple in its battle w …</p>\n<p><a href=\"https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi\">Read the full story at The Verge.</a></p>",
      "author": "Terrence O’Brien",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "75e956e8-539e-4664-bd46-dbcbb9dc6136",
      "title": "MicroSD Express cards and Anker’s travel adapter rule the deal roost this week",
      "link": "https://www.theverge.com/gadgets/866788/anker-nano-travel-adapter-samsung-p9-microsd-express-card-deal-sale",
      "published": "2026-01-24T18:21:02+00:00",
      "summary": "Welcome to the weekend, friends! We’re still in a bit of a deals lull before the Presidents Day and V-Day sales begin, the bulk of which we anticipate kicking off the first week of February. However, for now, we’re still seeing some solid discounts on a few newer gadgets and some old, Verge-approved favorites. Anker’s [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/Anker-Nano-Travel-Adapter-Deal-Image.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Welcome to the weekend, friends! We’re still in a bit of a deals lull before the Presidents Day and V-Day sales begin, the bulk of which we anticipate kicking off the first week of February. However, for now, we’re still seeing some solid discounts on a few newer gadgets and some old, <em>Verge</em>-approved favorites. <a href=\"https://www.amazon.com/Anker-Adapter-Temperature-Compatible-Countries/dp/B0DHVNW1CN/\">Anker’s Nano Travel Adapter</a> has returned to its best price to date, for instance, as has <a href=\"https://electronics.woot.com/offers/samsung-qn43ls03fafxza-samsung-qn43ls03fafxza-frame-b\">Samsung’s last-gen Frame TV</a>. You’ll also find discounts on <a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT99KCV8/\">microSD Express cards</a>, <a href=\"https://www.amazon.com/dp/B0DGRJKDKC/\">budget-friendly robot vacuums</a>, and more, so let’s get into it.</p>\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<p class=\"has-text-align-none\">If you have plans to spend some time outside of the US this year, <strong><a href=\"https://www.theverge.com/news/627648/anker-nano-travel-adapter-5-in-1-us-europe-australia\">Anker’s versatile Nano Travel Adapter</a></strong> is on sale at Amazon in <a href=\"https://www.amazon.com/Anker-Adapter-Temperature-Compatible-Countries/dp/B0DHVNW1CN/\">black</a> and <a href=\"https://www.amazon.com/Anker-Adapter-Temperature-Compatible-Countries/dp/B0DHVNPN7J/\">white</a> — and directly from <a href=\"https://www.anker.com/products/a9215?variant=44790594044054\">Anker</a> with code <strong>WS7DV21AXQQZ</strong> — for $19.99 ($6 off), matching its lowest price to date.</p>\n\n<p class=\"has-text-align-none\">Anker’s thin, foldable charger measures a mere 0.98 inches thick and sports a pair of USB-C ports, two USB-A ports, and a US-style Type A outlet on the front, in addition to four plug types (Type A, C, G, and I). The main drawback, aside from the lack of a voltage converter, is that the maximum power output is 20W (or 15W when sharing power across all four USB ports), meaning you’ll need to bring <em>another</em> adapter if you want to charge a laptop or any other power-hungry device.</p>\n<div class=\"product-block\"><h3>Anker Nano Travel Adapter (5-in-1, 20W)</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/anker_travel1.webp?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Anker-Adapter-Temperature-Compatible-Countries/dp/B0DHVNW1CN/\"> <strike>$25.99</strike> $19.99 at <strong>Amazon (black)</strong></a></li><li><a href=\"https://www.amazon.com/Anker-Adapter-Temperature-Compatible-Countries/dp/B0DHVNPN7J/\"> <strike>$25.99</strike> $19.99 at <strong>Amazon (white)</strong></a></li><li><a href=\"https://www.anker.com/products/a9215?variant=44790594044054\"> <strike>$25.99</strike> $19.99 at <strong>Anker</strong></a></li></ul></div>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<p class=\"has-text-align-none\">It’s been nearly eight months since the launch of the Nintendo Switch 2 — meaning, if you haven’t already purchased a microSD Express card to level up your storage capacity of your console, you’ll likely need to do so soon. Fortunately, <strong>Samsung’s P9 microSD Express card</strong> is currently on sale at <a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT99KCV8/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1924975-REG/samsung_mb_mk256t_am_256gb_p9_microsd_express.html/\">B&amp;H Photo</a> with 256GB of storage starting at $39.99 ($15 off), matching its second-best price to date.</p>\n\n<p class=\"has-text-align-none\">As you might expect, P9 is&nbsp;built to handle the Switch 2’s faster storage speeds, with sequential read speeds of up to 800 MB/s, resulting in quicker load and launch times. The Switch 2 features 256GB of internal storage, meaning you’re doubling your storage capacity with a 256GB card, or tripling it in the case of <a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT995SPF/\">Samsung’s 512GB variant</a>. Most first-party Nintendo games aren’t massive, mind you, but third-party titles like <em><a href=\"https://www.theverge.com/games-review/623660/split-fiction-review-hazelight-studios-it-takes-two\">Split Fiction</a></em> (69GB) and <em>Madden NFL 26</em> (59GB) can quickly devour dozens of gigabytes. That makes picking up a discounted microSD Express card a no-brainer, especially since they’re also compatible with cameras, drones, and any gadget with a microSD USH-I slot.</p>\n<div class=\"product-block\"><h3>Samsung P9 microSD Express Card</h3>\n<figure class=\"product-image\"><img alt=\"Samsung&#039;s P9 microSD Express card next to an Android phone with a controller attached.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/11/Samsung-P9-MicroSD-Express-Card.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT99KCV8/\"> <strike>$54.99</strike> $39.99 at <strong>Amazon (256GB)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1924975-REG/samsung_mb_mk256t_am_256gb_p9_microsd_express.html/\"> <strike>$54.99</strike> $39.99 at <strong>B&amp;H Photo (256GB)</strong></a></li><li><a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT995SPF/\"> <strike>$99.99</strike> $79.99 at <strong>Amazon (512GB)</strong></a></li></ul></div>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<p class=\"has-text-align-none\">I hate to break it to you, but so-called “art TVs” <a href=\"https://www.theverge.com/tech/829002/youre-buying-a-frame-tv-its-okay-to-cheap-out-a-little\">are not exceptional TVs</a>, at least not in a traditional sense. Still, <strong>Samsung’s 2025 Frame TV</strong> — which is <a href=\"https://electronics.woot.com/offers/samsung-qn43ls03fafxza-samsung-qn43ls03fafxza-frame-b\">on sale at Woot</a> in its&nbsp;43-inch&nbsp;configuration starting at $597.99 ($302 off) through January 31st — is likely to look far better in your living room when idle than your typical LCD or OLED TV.</p>\n\n<p class=\"has-text-align-none\">Samsung’s last-gen 4K TV is vastly different than the <a href=\"https://www.theverge.com/news/864027/samsung-two-new-sizes-of-frame-tvs-ces\">company’s 2026 panels</a>, either. The slim QLED display can cycle through a small selection of free art pieces when idle, all of which take on a more textured, canvas-like appearance thanks to an anti-glare matte coating that helps curb unwanted reflections. The Frame is plenty good enough for bingeing <em>Slow Horses</em> and <em>Stranger Things</em>, even if the refresh rate is capped at 60Hz, and you still get support for both HDR10 Plus and Dolby Atmos, along with access to all your favorite streaming apps.</p>\n<div class=\"product-block\"><h3>Samsung The Frame (2025)</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"132\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/samsung43inchtheframe.avif?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://electronics.woot.com/offers/samsung-qn43ls03fafxza-samsung-qn43ls03fafxza-frame-b\"> <strike>$899.99</strike> $597.99 at <strong>Woot (43-inch)</strong></a></li><li><a href=\"https://electronics.woot.com/offers/samsung-qn43ls03fafxza-samsung-qn43ls03fafxza-frame-b\"> <strike>$1099.99</strike> $697.99 at <strong>Woot (50-inch)</strong></a></li></ul></div>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<p class=\"has-text-align-none\"><span>DJI’s drones might ha</span>ve been <a href=\"https://www.theverge.com/news/831241/dji-ban-us-trump-fcc-customs-import-ndaa\">banned in the United States</a>, but you can still pick up some of the company’s other gear stateside (at least for now).&nbsp;Take <strong><a href=\"https://www.theverge.com/2024/11/26/24305428/dji-mic-mini-osmo-audio-microphone-wireless\">DJI’s Mic Mini</a></strong>, for instance, which&nbsp;is currently on sale at&nbsp;<a href=\"https://www.amazon.com/dp/B0FKL8JYGQ/\">Amazon</a>&nbsp;with a single mic and two transmitters for $59.99 ($20 off), matching the record-low first set during this time last year.</p>\n\n<p class=\"has-text-align-none\">If you want to capture audio that sounds more professional than your smartphone can deliver on the go, the Mic Mini is a commendable option. The compact, 10-gram wireless microphone plugs directly into your phone via USB-C, Lightning, or a standard 3.5mm audio cable, and it can be clipped to clothing or worn using a magnetic mount or lanyard. The receiver lasts up to 10.5 hours and includes an onboard dial, which lets you fine-tune gain settings and adjust your volume levels. The pair of included transmitters, meanwhile, can run for up to 11.5 hours on a single charge and capture audio from up to about 400 meters away, provided they’re connected simultaneously.</p>\n\n<p class=\"has-text-align-none\">Just don’t expect built-in backup recording or the option to connect a smaller lav mic, neither of which is available on the Mic Mini.</p>\n<div class=\"product-block\"><h3>DJI Mic Mini (with one mic and two transmitters)</h3>\n<figure class=\"product-image\"><img alt=\"The DJI Mic Mini system’s new wireless receiver attached to a laptop’s USB-C port.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25755998/dji_mic_mini3.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0FKL8JYGQ/\"> <strike>$79</strike> $59 at <strong>Amazon</strong></a></li></ul></div>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<h2 class=\"wp-block-heading has-text-align-none\">More ways to save this weekend</h2>\n\n<ul class=\"wp-block-list\">\n<li>Of all the games coming out this year, <em><strong><a href=\"https://www.theverge.com/news/681325/resident-evil-requiem-trailer-date\">Resident Evil Requiem</a></strong></em>&nbsp;might be at the top of my list. If you’re in the same camp, you can preorder the Steam version (via a digital key) for PC through&nbsp;<a href=\"https://www.anrdoezrs.net/links/8836598/type/dlg/sid/__vg0123awD__864339____s______________theverge.com/https://www.fanatical.com/en/game/resident-evil-requiem\" rel=\"noreferrer noopener\" target=\"_blank\"></a><a href=\"https://www.fanatical.com/en/game/resident-evil-requiem/\">Fanatical</a> for $57.39 (about $13 off), which is likely the best price we’re going to see in the next mainline <em>RE</em> before it launches on February 27th. I, for one, can’t wait for my return to Racoon City, especially since the ninth installment of the survival horror game will let you toggle between first- and third-person perspectives on the fly.</li>\n\n\n\n<li>If you find the price of most robot vacuums intimidating, <strong>Tapo’s RV30 Max Plus</strong> is down to an all-time low of $179.99 ($150 off) at <a href=\"https://www.amazon.com/dp/B0DGRJKDKC/\">Amazon</a>. The RV30 remains <a href=\"https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop\">our favorite budget vacuum / mop</a>, namely because it offers a bevy of features found in robovacs that cost twice the price, including an auto-empty dock, smart lidar-based navigation, multiple suction and water levels, and room-specific cleaning with the ability to add virtual walls and no-go zones via the app. You also get a large 300ml tank and 5,200Pa of suction power, which is terrific for a bot in this price range.</li>\n\n\n\n<li>The <strong>JLab Go Air Pop ANC</strong> are on sale at <a href=\"https://www.amazon.com/gp/product/B0DKB2B55L/\">Amazon</a>, <a href=\"https://www.walmart.com/ip/JLab-Go-Pop-Active-Noise-Cancelling-Bluetooth-Earbuds-Charging-Case-Transparent-Teal/14676171105\">JLab</a>, and <a href=\"https://www.bestbuy.com/product/jlab-go-pop-anc-true-wireless-earbuds-cloud-foam-tips-purple/J3GW8XZHW9/sku/6631192\">Best Buy</a> for $19.99 ($10 off), which is about $2 shy of their best price to date. They come up a little short in terms of audio quality, but you’d be hard-pressed to find another pair of wireless earbuds that offer a customizable EQ, ANC, multipoint connectivity, and seven hours of playback for under $20. Then there’s the translucent design, which is an even bigger selling point in my book.</li>\n</ul>\n\n<p class=\"has-text-align-none\"></p>",
      "author": "Brandon Widder",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "854eebe1-bbb9-4411-a969-da0d381d07c7",
      "title": "Gmail’s spam filter and automatic sorting are broken",
      "link": "https://www.theverge.com/tech/867247/gmails-spam-filter-broken",
      "published": "2026-01-24T17:54:10+00:00",
      "summary": "Some Gmail users may have noticed that promotional emails that normally go to their own siloed tab have started flooding their inbox. Reports hit the Google forums and Reddit that messages are bypassing the Updates and Promotional filters and went straight to Gmail inboxes. Some also reported seeing a banner at the top of some [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/acastro_STK459_09.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Some Gmail users may have noticed that promotional emails that normally go to their own siloed tab have started flooding their inbox. <a href=\"https://www.reddit.com/r/GMail/comments/1qln9zp/gmail_not_filtering_promotions/\">Reports</a> <a href=\"https://www.reddit.com/r/GMail/comments/1qlpc1d/whats_happening_with_gmail/?share_id=M9G3ZxSQD7eml9M0s8FFz&amp;utm_content=1&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_source=share&amp;utm_term=1\">hit</a> the <a href=\"https://support.google.com/mail/threads?hl=en&amp;thread_filter=(%27promotion%27)&amp;sjid=15078895787479354225-NA&amp;max_results=20\">Google forums</a> and <a href=\"https://www.reddit.com/r/GMail/comments/1qlq1pm/major_gmail_disruptionshields_down/?share_id=Uzo5wrqP45o77MY68Ra79&amp;utm_content=1&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_source=share&amp;utm_term=1\">Reddit</a> that messages are bypassing the Updates and Promotional filters and went straight to Gmail inboxes. Some also reported seeing a banner at the top of some messages warning them to \"be careful with this message,\" explaining that it hasn't been fully scanned for spam or malware.</p>\n<p class=\"has-text-align-none\">Google acknowledged the issue, posting on the <a href=\"https://www.google.com/appsstatus/dashboard/incidents/NNnDkY9CJ36annsfytjQ\">Workspace Status Dashboard</a>:</p>\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-text-align-none\">Gmail users might see banners indicating missing spam checks.We are experiencing an issue with Gmail beginning on Saturd …</p></blockquote>\n<p><a href=\"https://www.theverge.com/tech/867247/gmails-spam-filter-broken\">Read the full story at The Verge.</a></p>",
      "author": "Terrence O’Brien",
      "fetched_at": "2026-01-25T23:54:07.694939+00:00"
    },
    {
      "item_id": "ead43a82-0954-4793-b7fa-3d95617786c5",
      "title": "Google has finally killed the Stadia Bluetooth tool — but this person rescued it",
      "link": "https://www.theverge.com/tech/864543/google-has-finally-killed-the-stadia-bluetooth-tool-but-this-person-rescued-it",
      "published": "2026-01-20T19:50:46+00:00",
      "summary": "Did you save your Google Stadia controller like I told you last month? It's still not too late. This week, Google has finally removed the tool that converts the now-useless controller into a decent Bluetooth gamepad. But there's another way. Christopher Klay, who previously developed the Stadia Enhanced browser extension, is one of many who [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/akrales_191113_3779_0163.webp?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Did you save your Google Stadia controller <a href=\"https://www.theverge.com/games/829631/save-google-stadia-gamepad-steam-deadline\">like I told you last month</a>? It's <em>still </em>not too late. This week, Google has <a href=\"https://9to5google.com/2026/01/20/google-stadia-controller-conversion-tool-dead/\">finally removed the tool</a> that converts the now-useless controller into a decent Bluetooth gamepad. But there's another way.</p>\n<p class=\"has-text-align-none\">Christopher Klay, who previously developed the Stadia Enhanced browser extension, is one of many who saved a copy of the tool to <a href=\"https://github.com/ChristopherKlay/stadiacontroller\">a personal GitHub page</a>. What's more, they're hosting a working copy of that Google website <a href=\"https://christopherklay.github.io/stadiacontroller/\">right here</a> to make it even easier. </p>\n<p class=\"has-text-align-none\">I haven't tried Klay's mirror, as both of my gamepads are already converted, but <a href=\"https://www.youtube.com/watch?v=w-4yYrTyoiY\">here's my video</a> on how easy the process is. It's worth doing now tha …</p>\n<p><a href=\"https://www.theverge.com/tech/864543/google-has-finally-killed-the-stadia-bluetooth-tool-but-this-person-rescued-it\">Read the full story at The Verge.</a></p>",
      "author": "Sean Hollister",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "03183efa-6fa8-446f-8f3d-d3db29141d6b",
      "title": "Samsung’s discounted microSD Express card more than doubles your Switch 2 storage",
      "link": "https://www.theverge.com/gadgets/864404/samsung-p9-microsd-express-card-deal-sale",
      "published": "2026-01-20T18:36:47+00:00",
      "summary": "If you buy digital games for the Nintendo Switch 2, Samsung’s P9 microSD Express card offers an easier way to expand your storage without constantly deleting games to make room. It’s cheaper than other microSD cards, and it’s an even better value right now, with the 512GB version priced at $79.99 ($40 off) — just [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/us-feature-all-your-games-in-one-tiny-card-549390596.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tSamsung’s P9 microSD Express card is a relatively affordable way to upgrade Switch 2 storage.\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">If you buy digital games for the Nintendo Switch 2, <strong>Samsung’s P9 microSD Express card</strong> offers an easier way to expand your storage without constantly deleting games to make room. It’s cheaper than other microSD cards, and it’s an even better value right now, with the 512GB version <a href=\"https://www.amazon.com/dp/B0FT995SPF/\">priced at $79.99 ($40 off)</a> — just $5 shy of its best price to date. You can alternatively buy the 256GB model for <a href=\"https://www.amazon.com/dp/B0FT99KCV8/\">$39.99 ($15 off) at Amazon</a>.</p>\n<div class=\"product-block\"><h3>Samsung P9 microSD Express Card</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"221\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/samsungpn9.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT99KCV8/\"> <strike>$54.99</strike> $39.99 at <strong>Amazon (256GB)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1924975-REG/samsung_mb_mk256t_am_256gb_p9_microsd_express.html/\"> <strike>$54.99</strike> $39.99 at <strong>B&amp;H Photo (256GB)</strong></a></li><li><a href=\"https://www.amazon.com/Samsung-Express-microSDXC-Nintendo-Switch-AM/dp/B0FT995SPF/\"> <strike>$99.99</strike> $79.99 at <strong>Amazon (512GB)</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">While the Switch 2’s 256GB internal storage is enough for most first-party Nintendo games, just one or two large downloads can quickly eat up space. <a href=\"https://www.theverge.com/2023/9/20/23881536/cyberpunk-2077-phantom-liberty-update-2-0\"><em>Cyberpunk 2077</em></a>, for example, takes up 59GB, while <em>Final Fantasy VII Remake Intergrade</em> on Switch 2 is a 93GB download — meaning that buying both would use up over half of the console’s internal storage.&nbsp;Many third-party games eat up dozens of gigabytes each as well, which means it’s only a matter of time before that 256GB fills up.</p>\n\n<p class=\"has-text-align-none\">That’s what makes Samsung’s P9 a smart investment. It gives you the flexibility to grow your digital library, and it’s built to handle the Switch 2’s faster storage speeds — so you can add games without noticeably affecting performance. All in all, it’s a great buy if you want to avoid running out of space as your Switch 2 library grows. And as a bonus, you can also use it with other compatible devices — including some cameras, tablets, and drones that support microSD cards.</p>",
      "author": "Sheena Vasani",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "6ef30028-1f3b-48fe-838a-454a9d7d4da4",
      "title": "Life is Strange will bring the Max and Chloe story to an end in new game",
      "link": "https://www.theverge.com/games/864438/life-is-strange-reunion-release-date-max-chloe",
      "published": "2026-01-20T18:30:00+00:00",
      "summary": "A little over a decade ago, Life is Strange burst onto the scene with a unique blend of teen drama and interactive storytelling. That first game told the story of Max Caulfield, who had the supernatural ability to reverse time, and her best friend Chloe Price. Now developer Deck Nine Games is finally bringing their [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/01_Max_Rewind.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">A little over a decade ago, <em><a href=\"https://www.theverge.com/2015/10/28/9627302/life-is-strange-season-wrap-up\">Life is Strange</a></em> burst onto the scene with a unique blend of teen drama and interactive storytelling. That first game told the story of Max Caulfield, who had the supernatural ability to reverse time, and her best friend Chloe Price. Now developer Deck Nine Games is finally bringing their story to an end with a new game called <em>Reunion</em>.</p>\n<p class=\"has-text-align-none\">The latest entry in the series follows <a href=\"https://www.theverge.com/24289524/life-is-strange-double-exposure-review-pc-ps5-xbox\">2024's <em>Double Exposure</em></a>, which similarly continued Max's story from the original game. The developer describes <em>Reunion</em> as the \"emotional conclusion of the Max and Chloe saga.\" Players will have three days to attempt to avoid a fire at their old  …</p>\n<p><a href=\"https://www.theverge.com/games/864438/life-is-strange-reunion-release-date-max-chloe\">Read the full story at The Verge.</a></p>",
      "author": "Andrew Webster",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "9f8751e5-f482-4eb4-a593-fcd5053d9cf3",
      "title": "The best iPad deals you can get right now",
      "link": "https://www.theverge.com/21280354/best-ipad-deals-apple",
      "published": "2026-01-20T17:57:00+00:00",
      "summary": "While the best iPad deals usually land during major sale events like Black Friday,&#160;many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most affordable iPad, the iPad Mini, and the latest iPad Air. Hell, [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/10/M5-iPad-Pro-angle.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tThe 13-inch Pro is getting dangerously close to laptop territory. | Photo: Amelia Holowaty Krales / The Verge\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">While the best iPad deals usually land during major sale events like Black Friday,&nbsp;many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most affordable iPad, the iPad Mini, and the latest iPad Air. Hell, you can even often find discounts on the <a href=\"https://www.theverge.com/tech/803105/apple-ipad-pro-2025-review-fast-faster-fastest\">latest M5 iPad Pro</a>, which is <a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWCXJVHN/\">already on sale</a> at multiple retailers. If you don’t need the latest tech, though, now may be a good time to save on the M4 Pro as inventory dwindles.</p>\n\n<p>All that being said, it’s difficult to know where exactly you can find the most notable iPad deals unless you’re scouring the major retailers on a daily basis. But that’s often what our deal hunters at&nbsp;<em>The Verge&nbsp;</em>are doing, so let us help you out. Below, we’ve listed the best deals you can get on each iPad model that is available, from the 11th-gen base iPad to the more powerful models with M3 and M4 chips.</p>\n\n<div class=\"wp-block-vox-media-highlight vox-media-highlight\">\n<h2 class=\"wp-block-heading\"></h2>\n\n\n</div>\n\n<h2 class=\"wp-block-heading\" id=\"CM2y8j\">The best <a href=\"https://www.theverge.com/apple/636335/ipad-2025-11th-generation-review\">iPad (2025)</a> deals</h2>\n<div class=\"product-block\"><h3>Apple iPad (11th-gen)</h3>\n<figure class=\"product-image\"><img alt=\"A photo of the 11th-generation iPad on a table.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/iPad-2025-front.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/New-Apple-iPad-11-inch-Display/dp/B0DZ75TN5F/\"> <strike>$349</strike> $319 at <strong>Amazon (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/Apple-iPad-11-inch-Display-All-Day/dp/B0DZ773FRV/\"> <strike>$449</strike> $429 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1883626-REG/apple_md4a4ll_a_11_ipad_a16_chip.html\"> <strike>$349</strike> $319 at <strong>B&amp;H Photo (128GB, Wi-Fi)</strong></a></li></ul></div>\n<p class=\"has-text-align-none\"><strong>Apple’s 11th-gen iPad </strong>landed on the scene in March. The <a href=\"https://www.theverge.com/news/621625/apple-ipad-2024-launch-price-availability\">newest base-model tablet</a> is a fairly iterative update of the <a href=\"https://www.theverge.com/23418039/apple-ipad-review-10th-gen-2022-10-9-tablet-ipados\">prior model</a>, but with 128GB of base storage (as opposed to 64GB) and the A16 Bionic chip, which is nearly 30 percent faster than the A14 chip used in the 10th-gen iPad. However, the newer chip doesn’t support the various Apple Intelligence features introduced in iPadOS 18.1 and subsequent updates. For that, you’ll want to opt for a more recent iPad Air, iPad Mini, or iPad Pro model.</p>\n\n<p class=\"has-text-align-none\">Pricing-wise, the latest iPad starts at $349 with Wi-Fi and 128GB of storage. You can also upgrade to 256GB or 512GB of storage for an additional $100 or $200, respectively, or purchase an LTE model starting at $499. We saw a pretty significant price drop to $279 during Black Friday; however, right now, it’s only available at <a href=\"https://www.amazon.com/gp/aw/d/B0DZ75TN5F/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1883626-REG/apple_md4a4ll_a_11_ipad_a16_chip.html\">B&amp;H Photo</a> starting at $319, saving you $30. Alternatively, you can purchase the 256GB model at <a href=\"https://www.amazon.com/Apple-iPad-11-inch-Display-All-Day/dp/B0DZ773FRV/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1883629-REG/apple_md4g4ll_a_11_ipad_a16_chip.html\">B&amp;H Photo</a> starting at $429 ($20 off), or the 512GB variant at <a href=\"https://www.amazon.com/gp/aw/d/B0DZ753ZT8/\">Amazon</a> starting at $600 ($50 off).</p>\n\n<h2 class=\"wp-block-heading\" id=\"njqbEo\">The best <a href=\"https://www.theverge.com/2024/10/22/24275956/apple-ipad-mini-2024-review\">iPad Mini (2024)</a> deals</h2>\n<div class=\"product-block\"><h3>iPad Mini (2024)</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"198\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/iPad_Mini_8.webp?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0DK3W4YHS/\"> <strike>$499</strike> $469 at <strong>Amazon (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1858548-REG/apple_mxn63ll_a_ipad_mini_wi_fi_128gb.html\"> <strike>$499</strike> $469 at <strong>B&amp;H Photo (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/dp/B0DK3XM94S/\"> <strike>$599</strike> $549 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li></ul></div>\n<p>The <strong>seventh-gen iPad Mini</strong> is similar in several ways to <a href=\"https://www.theverge.com/22696652/ipad-mini-2021-6th-gen-review\">the previous model,</a> but comes with some big internal upgrades. It includes faster Wi-Fi and USB-C speeds, support for the Apple Pencil Pro, and a newer A17 Pro processor with 8GB of RAM to support Apple Intelligence. Otherwise, it boasts nearly identical specs and features as the last-gen model, meaning it has an 8.3-inch Liquid Retina display and options for 5G. It may not be worth upgrading if you already own a sixth-gen Mini, but newcomers to the category will appreciate the upgrades.</p>\n\n<p>The 2024 iPad Mini starts at $499 with 128GB of storage, which was the price for the previous generation’s 64GB model. Electing for 256GB of storage brings the price up to $599, and the cellular models start at $649. These are some big numbers for a small iPad, so the larger iPad Air might be worth considering&nbsp;if you prefer your dollar to go further with more screen real estate. But if you want an Apple tablet in the smallest possible form factor, this is where the action is.</p>\n\n<p>Right now, the 128GB base model with Wi-Fi is on sale at <a href=\"https://www.amazon.com/dp/B0DK3W4YHS/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1858548-REG/apple_mxn63ll_a_ipad_mini_wi_fi_128gb.html\">B&amp;H Photo</a> in select colors starting at $469, which is a mere $30 discount and a far cry from its all-time low of $349. If you need additional storage, you can pick up the 256GB variant at <a href=\"https://www.amazon.com/dp/B0DK3XM94S/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1858552-REG/apple_mxna3ll_a_ipad_mini_wi_fi_256gb.html\">B&amp;H Photo</a> for $549 ($50 off), which is about $100 shy of the lowest price we’ve seen on the step-up configuration.</p>\n\n<h2 class=\"wp-block-heading has-text-align-none\" id=\"the-best-ipad-air-2024-deals\">The <a href=\"https://www.theverge.com/ipad/626647/apple-ipad-air-review-2025\">best iPad Air (2025)</a> deals</h2>\n<div class=\"product-block\"><h3>11-inch iPad Air M3</h3>\n<figure class=\"product-image\"><img alt=\"A photo of an iPad Air on a table.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/257606_iPad_air_ADiBenedetto_0002.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.bhphotovideo.com/c/product/1883561-REG/apple_mc9w4ll_a_11_ipad_air_m3.html/\"> <strike>$599</strike> $559 at <strong>B&amp;H Photo (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/Apple-11-inch-Intelligence-Display-All-Day/dp/B0DZ74YQ1V/\"> <strike>$599</strike> $559 at <strong>Amazon (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/dp/B0DZ74JXZQ/\"> <strike>$699</strike> $643.93 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li></ul></div><div class=\"product-block\"><h3>13-inch iPad Air M3</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/13-inch-iPad-Air-M3-Lifestyle-Press-Image.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Apple-13-inch-Intelligence-Display-All-Day/dp/B0DZ763J9M/\"> <strike>$799</strike> $729 at <strong>Amazon (128GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/Apple-13-inch-Intelligence-Display-All-Day/dp/B0DZ75MMRH/\"> <strike>$899</strike> $824.99 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1883610-REG/apple_mcnj4ll_a_13_ipad_air_m3.html/\"> <strike>$799</strike> $729 at <strong>B&amp;H Photo (128GB, Wi-Fi)</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">The <strong>2025 iPad Air</strong> is little more than a spec bump over the <a href=\"https://www.theverge.com/24155407/apple-ipad-air-review-2024\">previous model</a>, with a few technical upgrades that should allow it to last longer into the future than either the entry-level iPad or the last-gen Air. It features an M3 chip with support for Apple Intelligence, plus compatibility with Apple’s latest Magic Keyboard that has a larger trackpad and an extra row of function keys. In short, the Air is a credible laptop replacement.</p>\n\n<p class=\"has-text-align-none\">The 11-inch model starts at $599 and the 13-inch variant $799 — the same price as prior models — but it’s common to see discounts from third-party retailers. Right now, for instance, the 11-inch Air is on sale at <a href=\"https://www.amazon.com/Apple-11-inch-Intelligence-Display-All-Day/dp/B0DZ74YQ1V/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1883561-REG/apple_mc9w4ll_a_11_ipad_air_m3.html/\">B&amp;H Photo</a> in its base configuration with Wi-Fi and 128GB of storage starting at $559, which is $40 off but the highest sale price we’ve seen in months. You can also grab the 256GB model at <a href=\"https://www.amazon.com/dp/B0DZ74JXZQ/\">Amazon</a> starting at $643.93 (about $55 off), or the step-up 512GB model at <a href=\"https://www.amazon.com/Apple-11-inch-Intelligence-Display-All-Day/dp/B0DZ7466KC/\">Amazon</a> for $824.99 (about $74 off).</p>\n\n<p class=\"has-text-align-none\">The larger 13-inch model, meanwhile, is on sale at <a href=\"https://www.amazon.com/Apple-13-inch-Intelligence-Display-All-Day/dp/B0DZ763J9M/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1883610-REG/apple_mcnj4ll_a_13_ipad_air_m3.html/\">B&amp;H Photo</a> with Wi-Fi and 128GB of storage starting at $729 ($70 off), which is almost $100 shy of its best price to date. You can also grab the 256GB model at <a href=\"https://www.amazon.com/Apple-13-inch-Intelligence-Display-All-Day/dp/B0DZ75MMRH/\">Amazon</a> starting at $824.99 (about $74 off), or the step-up 512GB model at <a href=\"https://www.amazon.com/Apple-13-inch-Intelligence-Display-All-Day/dp/B0DZ74RTQD/\">Amazon</a> for $1,012.17 (about $87 off), neither of which matches the lows we saw toward the end of last year.</p>\n\n<h2 class=\"wp-block-heading\" id=\"the-best-ipad-pro-2025-deals\">The best <a href=\"https://www.theverge.com/tech/803105/apple-ipad-pro-2025-review-fast-faster-fastest\">iPad Pro (2025)</a> deals</h2>\n<div class=\"product-block\"><h3>11-inch iPad Pro (M5, 2025)</h3>\n<figure class=\"product-image\"><img alt=\"A photo of the backside of the iPad Pro.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/10/M5-iPad-Pro-back-1.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWCXJVHN/\"> <strike>$999</strike> $899 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWD1LZBB/\"> <strike>$1199</strike> $1099 at <strong>Amazon (512GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1925484-REG/apple_mdwk4ll_a_11_ipad_pro_m5.html\"> <strike>$999</strike> $899 at <strong>B&amp;H Photo (256GB, Wi-Fi)</strong></a></li></ul></div><div class=\"product-block\"><h3>13-inch iPad Pro (2025)</h3>\n<figure class=\"product-image\"><img alt=\"A photo of the M5 iPad Pro.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/10/M5-iPad-Pro-2.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0FWD1MT5D/\"> <strike>$1299</strike> $1199 at <strong>Amazon (256GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1925485-REG/apple_mdyj4ll_a_apple_13_ipad_pro.html\"> <strike>$1299</strike> $1199 at <strong>B&amp;H Photo (256GB, Wi-Fi)</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1925503-REG/apple_mdyl4ll_a_apple_13_ipad_pro.html\"> <strike>$1499</strike> $1399 at <strong>B&amp;H Photo (512GB, Wi-Fi)</strong></a></li></ul></div>\n<p>While there are some deals floating around for the <a href=\"https://www.theverge.com/24155440/apple-ipad-pro-2024-review\">M4 iPad Pro</a>, we’d argue none of them are particularly noteworthy given the current discounts on the <a href=\"https://www.theverge.com/news/799352/apple-ipad-pro-m5-price-release-date\">2025 iPad Pro</a>. Apple’s latest high-end tablet offers a few upgrades over the last-gen model, including a faster M5 chip, a new C1X cellular modem (if you get the cellular version), and an N1 chip for Wi-Fi, Bluetooth, and Thread. Apple also increased read and write speeds to memory, and the latest Pro supports fast charging, allowing you to charge it to 50 percent capacity in about 30 minutes.</p>\n\n<p class=\"has-text-align-none\">Although the tablet launched in October, we’re already seeing the price drop at several retailers. The 11-inch base model with 256GB of storage is currently down to $899 ($100 off) at <a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWCXJVHN/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1925484-REG/apple_mdwk4ll_a_11_ipad_pro_m5.html\">B&amp;H Photo</a>, for instance, while the model with Wi-Fi and 512GB of storage is on sale at <a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWD1LZBB/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1925492-REG/apple_mdwm4ll_a_11_ipad_pro_m5.html\">B&amp;H Photo</a> for $1,099 ($100 off). You can also snag the configuration with Wi-Fi and 1TB of storage for $1,510 (about $89 off) at <a href=\"https://www.amazon.com/Apple-iPad-Pro-11-inch-Landscape/dp/B0FWD1N7DQ/?th=1\">Amazon</a>.</p>\n\n<p class=\"has-text-align-none\">If you want a larger display, you can get the 13-inch iPad Pro in its 256GB base configuration for $1,199 ($100 off) at <a href=\"https://www.amazon.com/dp/B0FWD1MT5D/\">Amazon</a> and <a href=\"https://www.bhphotovideo.com/c/product/1925485-REG/apple_mdyj4ll_a_apple_13_ipad_pro.html\">B&amp;H Photo</a>, which is the second-best price we’ve seen on the premium 13-incher. The step-up model with Wi-Fi and 512GB of storage, meanwhile, is down to $1,399 (also $100 off) at <a href=\"https://www.bhphotovideo.com/c/product/1925503-REG/apple_mdyl4ll_a_apple_13_ipad_pro.html\">B&amp;H Photo</a>, while the 1TB model can be had at <a href=\"https://www.amazon.com/dp/B0FWD6SPL8/\">Amazon</a> for $1,759 (about $140 off), roughly $20 more than its lowest price to date.</p>\n\n<p class=\"has-text-align-none\"><em><strong>Update, January 20th: </strong>Updated to reflect current pricing and availability.</em></p>",
      "author": "Brandon Russell",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "eb45c767-b0d5-4c2e-a655-e7b862c69269",
      "title": "Netflix’s Star Search will let you vote to decide who wins",
      "link": "https://www.theverge.com/entertainment/864424/netflix-star-search-live-voting",
      "published": "2026-01-20T17:19:41+00:00",
      "summary": "Though Netflix's upcoming Star Search reboot will feature a panel of celebrity judges, viewers are going to have a hand in choosing which contestants win the competition. Ahead of Star Search's premiere tonight, Netflix has announced that it is launching a new real-time voting functionality that will give you the ability to tell the streamer [&#8230;]",
      "content": "<figure>\n\n<img alt=\"Chrissy Teigen, Jelly Roll, Sarah Michelle Gellar, and Anthony Anderson.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/03_StarSet_GroupShot_0610_R3_B.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Though Netflix's upcoming <a href=\"https://www.theverge.com/streaming/828895/star-seartch-netflix-trailer\"><em>Star Search </em>reboot</a> will feature a panel of celebrity judges, viewers are going to have a hand in choosing which contestants win the competition.</p>\n<p class=\"has-text-align-none\">Ahead of <em>Star Search</em>'s premiere tonight, <a href=\"https://about.netflix.com/en/news/now-you-can-play-a-role-in-our-live-events-with-real-time-voting\">Netflix has announced</a> that it is launching a new real-time voting functionality that will give you the ability to tell the streamer which performer you want to see succeed. Rather than having to send in a text message or visit a special website as was the case with <em>American Idol</em>, <em>Star Search</em>'s voting can be done within the Netflix app while the show is airing live on Tuesdays and Wednesdays at 9PM ET / 6PM PT. </p>\n<p class=\"has-text-align-none\">In addition to the a …</p>\n<p><a href=\"https://www.theverge.com/entertainment/864424/netflix-star-search-live-voting\">Read the full story at The Verge.</a></p>",
      "author": "Charles Pulliam-Moore",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "d50273de-d0ad-4901-9ef7-d05d61db3a73",
      "title": "Former Nintendo of America boss Doug Bowser is joining Hasbro",
      "link": "https://www.theverge.com/news/864412/nintendo-doug-bowser-joins-hasbro-build",
      "published": "2026-01-20T16:30:15+00:00",
      "summary": "Doug Bowser is joining Hasbro's board of directors just weeks after retiring as Nintendo of America's president, according to an announcement on Tuesday. Though Hasbro's press release doesn't provide any specifics about Bowser's role on the board of directors, the company has big plans for its future in video games. Hasbro already licenses its intellectual [&#8230;]",
      "content": "<figure>\n\n<img alt=\"A photo of Doug Bowser in front of a Nintendo-themed backdrop\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/gettyimages-2218038051.jpg?quality=90&#038;strip=all&#038;crop=17.922582575841,12.831055897095,72.179687327862,78.422437207882\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Doug Bowser is joining Hasbro's board of directors just weeks after retiring as Nintendo of America's president, according to <a href=\"https://newsroom.hasbro.com/news-releases/news-release-details/hasbro-announces-additions-board-directors\">an announcement on Tuesday</a>.</p>\n<p class=\"has-text-align-none\">Though Hasbro's press release doesn't provide any specifics about Bowser's role on the board of directors, the company has big plans for its future in video games. Hasbro already licenses its intellectual property, including<a href=\"https://www.theverge.com/news/608321/magic-the-gathering-film-tv-universe-hasbro\"> <em>Magic: The Gathering</em></a> and <a href=\"https://www.theverge.com/23861883/baldurs-gate-3-ps5-technical-review\"><em>Dungeons &amp; Dragons</em></a>, for video game titles, but the company's chief marketing officer, Jason Bunge, said the company <a href=\"https://www.adweek.com/brand-marketing/brandweek-2025-hasbro-to-develop-its-own-video-games/\">aims to develop its first video game this year</a> as part of a broader foray into the gaming industry.</p>\n<p class=\"has-text-align-none\">Bowser became the head of N …</p>\n<p><a href=\"https://www.theverge.com/news/864412/nintendo-doug-bowser-joins-hasbro-build\">Read the full story at The Verge.</a></p>",
      "author": "Emma Roth",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "628832ba-e9e9-4cbc-9d5b-d8f3d3d2710d",
      "title": "Corsair’s wired Hall effect gaming keyboard is cheaper than ever",
      "link": "https://www.theverge.com/gadgets/864339/corsair-hall-effect-gaming-keyboard-resident-evil-requiem-surface-laptop-deal-sale",
      "published": "2026-01-20T15:35:00+00:00",
      "summary": "Hall effect switches are the most customizable and fastest you can currently get in a gaming keyboard. As such, they don&#8217;t usually come cheap. However, they&#8217;re fairly affordable to upgrade to today thanks to a deal on Corsair’s Vanguard Pro 96, which is cheaper than ever at Amazon and Best Buy, selling for $159.99 (originally [&#8230;]",
      "content": "<figure>\n\n<img alt=\"An image showing the Corsair Vanguard Pro 96 keyboard\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/corsairvanguardlede.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Hall effect switches are the most customizable and fastest you can currently get in a gaming keyboard. As such, they don&#8217;t usually come cheap. However, they&#8217;re fairly affordable to upgrade to today thanks to a deal on <strong>Corsair’s Vanguard Pro 96</strong>, which is cheaper than ever at <a href=\"https://www.amazon.com/dp/B0FKHPRZ45/\">Amazon</a> and <a href=\"https://www.bestbuy.com/product/corsair-vanguard-pro-96-rgb-wired-magnetic-mgx-linear-hall-effect-96-gaming-keyboard-with-flashtap-socd-rapid-trigger-black/J39TSCPZC5/sku/6637498\">Best Buy</a>, selling for $159.99 (originally $229.99). This keyboard lets you adjust the actuation distance of each key — requiring less or more force to register key presses.</p>\n<div class=\"product-block\"><h3>Corsair Vanguard Pro 96</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/corsairvanguard.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0FKHPRZ45/\"> <strike>$230</strike> $159.99 at <strong>Amazon</strong></a></li><li><a href=\"https://www.bestbuy.com/product/corsair-vanguard-pro-96-rgb-wired-magnetic-mgx-linear-hall-effect-96-gaming-keyboard-with-flashtap-socd-rapid-trigger-black/J39TSCPZC5/sku/6637498\"> <strike>$230</strike> $159.99 at <strong>Best Buy</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">I’m typing this on the <a href=\"https://www.theverge.com/tech/854886/corsair-galleon-100-sd-elgato-stream-deck-specs-price-launch\">Corsair Galleon 100 SD</a>, the company’s new $349.99 full-size mechanical keyboard that has full Stream Deck integration and is coming out later this month. And, you know what? I can see some similarities between it and the Vanguard Pro 96, despite the underlying switch tech being different. The Vanguard has a rotary dial, an info-dense LCD screen, nice aluminum housing for the keyboard, plus a magnetic-attaching wrist rest that’s plush and looks sophisticated. It has six programmable macro keys along the leftmost edge, and you can customize its settings through Corsair’s web app. If you want customizable switches, the Vanguard is the better keyboard to buy.</p>\n\n<h2 class=\"wp-block-heading has-text-align-none\">Other <em>Verge</em>-approved deals to get your Tuesday started</h2>\n\n<ul class=\"wp-block-list\">\n<li>Perhaps you already know you’re going to dive into <em><strong>Resident Evil Requiem</strong></em> on launch day. If that’s you, and you’re a PC gamer, the Steam version is 18 percent off to preorder through <a href=\"https://www.fanatical.com/en/game/resident-evil-requiem\">Fanatical</a>, a code seller that I’ve used numerous times without issue. The game will launch for $69.99, but you can nab a digital key to add to your Steam library for $57.39. <em>Requiem </em>is the next mainline entry in the franchise, giving players the ability to toggle between first-person and third-person perspective at will. It will feature a new character, Grace, although Leon S. Kennedy makes his return to investigate what’s happening in Racoon City 30 years after the events of <em>Resident Evil 3: Nemesis</em>.</li>\n\n\n\n<li><a href=\"https://www.bestbuy.com/product/microsoft-surface-laptop-copilot-pc-13-8-touchscreen-snapdragon-x-plus-2024-16gb-memory-512gb-storage-7th-ed-dune/JJGXP2VV5L\">Best Buy</a> has marked down the <strong>13.8-inch Microsoft Surface Laptop</strong> with a Snapdragon X Plus processor, 16GB of RAM, and a 512GB SSD for the day. The “Dune” golden edition is $849.99 (originally $1,199.99), which isn’t its lowest-ever price. That was around $750 just ahead of Black Friday last year. Still, it’s not a bad deal for a fast, good-looking Windows 11 laptop. <a href=\"https://www.amazon.com/gp/product/B0CXKV9TSN\">Amazon</a> is also honoring this price, although it’s unclear if it’s just for January 20th, as it is at Best Buy. We consider this model to be <a href=\"https://www.theverge.com/21250695/best-laptops#:~:text=Best%20Snapdragon%20X%20laptop\">one of the best laptops</a> you can buy thanks to its all-day battery life, not to mention surprisingly great performance in most apps — you might not notice you’re using an ARM-based processor, until you need to emulate apps, which can tank battery life and performance compared to those that run natively. <a href=\"https://www.theverge.com/2024/6/25/24185462/microsoft-surface-laptop-7th-edition-review\">Read our review</a>.</li>\n\n\n\n<li>If you want to save on Nintendo Switch 2 games, you probably already know that the console’s best, newest games are rarely discounted. That’s why, whenever I have a game in mind that I want to buy, I get on <a href=\"https://www.newegg.com/Product/ComboDealDetails?ItemList=Combo.4849832\">Newegg</a> to see if it’s selling <strong>Nintendo eShop gift cards</strong> for less than MSRP. Turns out, right now you can get $100 worth of eShop store credit for $88. Even if you don’t want games, the credit can be used at the Nintendo Store on hardware and accessories.</li>\n</ul>",
      "author": "Cameron Faulkner",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "494e7f17-2a1b-46d5-9773-21c3e7f7cc14",
      "title": "Amazon’s CEO says tariffs are starting to ‘creep into’ pricing",
      "link": "https://www.theverge.com/news/864390/amazon-ceo-andy-jassy-tariffs-creep-into-pricing",
      "published": "2026-01-20T15:01:40+00:00",
      "summary": "Amazon CEO Andy Jassy says consumers are starting to see the impact of tariffs less than a year after President Donald Trump implemented sweeping fees on a range of imported goods. During an interview with CNBC, Jassy says the inventory Amazon and third-party sellers prebought in early 2025 to keep prices low has \"run out,\" [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/STKS488_TARIFFS_3_CVirginia_A.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Amazon CEO Andy Jassy says consumers are starting to see the impact of tariffs less than a year after President Donald Trump implemented <a href=\"https://www.theverge.com/tech/607947/donald-trump-tariffs-china-mexico-canada-explainer\">sweeping fees</a> on a range of imported goods. During <a href=\"https://www.youtube.com/watch?v=lw3FbOspa-o\">an interview with CNBC</a>, Jassy says the inventory Amazon and third-party sellers prebought in early 2025 to keep prices low has \"run out,\" which means \"you start to see some of the tariffs creep into some of the prices.\"</p>\n<p class=\"has-text-align-none\">The admission comes just one day after <a href=\"https://www.kielinstitut.de/publications/news/americas-own-goal-americans-pay-almost-entirely-for-trumps-tariffs/\">a study from the Kiel Institute for the World Economy</a> found that foreign exporters absorb just 4 percent of the cost of tariffs, while 96 percent is passed on to American consumers. \"Some sellers are d …</p>\n<p><a href=\"https://www.theverge.com/news/864390/amazon-ceo-andy-jassy-tariffs-creep-into-pricing\">Read the full story at The Verge.</a></p>",
      "author": "Emma Roth",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "91c3887b-360a-495c-b728-eacf2ec125db",
      "title": "How BYD beat Tesla",
      "link": "https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast",
      "published": "2026-01-20T13:40:00+00:00",
      "summary": "The Model S. The Mach-E. The Ioniq. The… Dolphin Surf? That's right, friends: There's a new biggest name in EVs, and it means you might soon be cruising down the highway in the Dolphin Surf. And you might love it. After years of Tesla dominance, a Chinese company called BYD has become the world's biggest [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/VRG_VST_0120_Site-1.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">The Model S. The Mach-E. The Ioniq. The… <a href=\"https://www.byd.com/eu/electric-cars/dolphin-surf\">Dolphin Surf?</a> That's right, friends: There's a new biggest name in EVs, and it means you might soon be cruising down the highway in the Dolphin Surf. And you might love it.</p>\n<p class=\"has-text-align-none\">After years of Tesla dominance, a <a href=\"https://insideevs.com/features/703248/byd-everything-you-need-to-know/\">Chinese company called BYD</a> has become the <a href=\"https://www.theverge.com/news/852649/tesla-q4-2025-sales-production-delivery-elon-musk\">world's biggest seller of electric vehicles</a>. On <a href=\"https://pod.link/vergecast\">this episode of <em>The Vergecast</em></a>, <em>The Verge</em>'s <a href=\"https://www.theverge.com/authors/andrew-j-hawkins\">Andy Hawkins</a> explains where BYD came from, why its cars are so compelling, and what its rise means for the future of EVs. He also helps us figure out whether and when BYD cars might come to the US and how an influx of Chinese cars - which <a href=\"https://www.theverge.com/transportation/828155/car-influencer-china-ev-youtube-influencer-pay-play\">the influencers already love</a> …</p>\n<p><a href=\"https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast\">Read the full story at The Verge.</a></p>",
      "author": "David Pierce",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "60aaf9d5-dc00-4b25-b80a-f4dcfad9fdfb",
      "title": "Netflix revises Warner Bros. bid to an all-cash offer",
      "link": "https://www.theverge.com/news/863318/netflix-warner-bros-discovery-merger-revision-cash-deal",
      "published": "2026-01-20T12:26:10+00:00",
      "summary": "Netflix has updated the acquisition terms for its Warner Bros. Discovery offer to an all-cash deal, replacing its initial $82.7 billion cash and stock agreement. The changes are designed to expedite the sale of WBD studios and streaming businesses, following repeated attempts by rival bidder Paramount to pressure shareholders into accepting its own $108 billion [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/STK072_STKB374_NETFLIX_WB_A.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Netflix has updated the acquisition terms for its Warner Bros. Discovery offer to <a href=\"https://ir.netflix.net/investor-news-and-events/financial-releases/press-release-details/2026/Netflix-and-Warner-Bros--Discovery-Amend-Agreement-to-All-Cash-Transaction/default.aspx\">an all-cash deal</a>, replacing its initial $82.7 billion cash and stock agreement. The changes are designed to expedite the <a href=\"https://www.theverge.com/news/839007/netflix-warner-acquisition\">sale of WBD studios and streaming businesses</a>, following repeated attempts by rival bidder Paramount to pressure shareholders into accepting its own $108 billion all-cash offer.</p>\n<p class=\"has-text-align-none\">\"The WBD Board continues to support and unanimously recommend our transaction, and we are confident that it will deliver the best outcome for stockholders, consumers, creators, and the broader entertainment community,\" said Ted Sarandos, co-CEO of Netflix. \"Our revise …</p>\n<p><a href=\"https://www.theverge.com/news/863318/netflix-warner-bros-discovery-merger-revision-cash-deal\">Read the full story at The Verge.</a></p>",
      "author": "Jess Weatherbed",
      "fetched_at": "2026-01-20T20:55:51.850858+00:00"
    },
    {
      "item_id": "2c4b3fd1-edfe-4816-b750-c872be360bfd",
      "title": "The Stream Deck Plus is back to its lowest price",
      "link": "https://www.theverge.com/gadgets/862274/elgato-stream-deck-plus-controller-deal-sale",
      "published": "2026-01-14T23:04:09+00:00",
      "summary": "If you’re looking for a simple way to streamline your workflow, the Elgato Stream Deck Plus is a handy productivity tool for automating everyday tasks. Right now, it’s on sale for $159.99 ($40 off) at Amazon, Best Buy, and B&#38;H Photo, which is its best price to date. Like the standard Stream Deck, the Stream [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24198362/Stream_Deck___Lifestyle_Shot_17.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\tThe Stream Deck Plus is on sale for $159.99.\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">If you’re looking for a simple way to streamline your workflow, the <strong>Elgato</strong> <strong>Stream Deck Plus</strong> is a handy productivity tool for automating everyday tasks. Right now, it’s on sale for $159.99 ($40 off) at <a href=\"https://www.amazon.com/Elgato-Production-Controller-Streaming-Customizable/dp/B0BJL8SJ59/\">Amazon</a>, <a href=\"https://www.bestbuy.com/product/elgato-stream-deck-studio-controller-with-customizable-touch-strip-and-dials-black/J39QHT7G34/sku/6524801?utm_source=feed&amp;extStoreId=1510&amp;ref=212&amp;loc=19718098496&amp;gclsrc=aw.ds&amp;gad_source=1&amp;gad_campaignid=19718083580&amp;gbraid=0AAAAAD-ORIjijFphiE4FluAAcPJX4LYxW&amp;gclid=CjwKCAiAmp3LBhAkEiwAJM2JUOZYWkhM2qHFMj44w-nCB4aZ0IeO8qoPFwJ2pT_Xto1hZyrzI0qnZxoCD5kQAvD_BwE\">Best Buy</a>, and <a href=\"https://www.bhphotovideo.com/c/product/1746371-REG/elgato_10gbd9901_stream_deck.html/?ap=y&amp;ap=y&amp;smp=y&amp;smp=y&amp;store=420&amp;lsft=BI%3A514&amp;gad_source=1&amp;gad_campaignid=21618833212&amp;gbraid=0AAAAAD7yMh0VEsi83D_Iplpxh_yYo2kQx&amp;gclid=CjwKCAiAmp3LBhAkEiwAJM2JUCtkfPLC-32T6qLyEdIvc1ogQGyT5HIu6HDH5GlwONjwk_td84yz1xoCRqQQAvD_BwE\">B&amp;H Photo</a>, which is its best price to date.</p>\n\n<p class=\"has-text-align-none\">Like the standard Stream Deck, the Stream Deck Plus comes with eight programmable keys you can use to automate tasks, such as muting yourself on a video call or turning off smart lights. The Plus, however, adds more customizability with four rotary dials that let you make fine adjustments, like changing the volume for a specific app.</p>\n<div class=\"product-block\"><h3>Elgato Stream Deck Plus</h3>\n<figure class=\"product-image\"><img alt=\"Elgato Stream Deck Plus pictured against colorful background\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24279907/226431_BOTM_Stream_Deck_AKrales_0011.jpg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Elgato-Production-Controller-Streaming-Customizable/dp/B0BJL8SJ59\"> <strike>$199.99</strike> $159.99 at <strong>Amazon (black)</strong></a></li><li><a href=\"https://www.bestbuy.com/product/elgato-stream-deck-studio-controller-with-customizable-touch-strip-and-dials-black/J39QHT7G34/sku/6524801?utm_source=feed&#038;extStoreId=1510&#038;ref=212&#038;loc=19718098496&#038;gclsrc=aw.ds&#038;gad_source=1&#038;gad_campaignid=19718083580&#038;gbraid=0AAAAAD-ORIjijFphiE4FluAAcPJX4LYxW&#038;gclid=CjwKCAiAmp3LBhAkEiwAJM2JUHYGwXkIn49oKRaFVcOOmOuW_heiap3_mTv-sojsUuoLUI1ZhmkOeBoC5B8QAvD_BwE\"> <strike>$199.99</strike> $159.99 at <strong>Best Buy</strong></a></li><li><a href=\"https://www.bhphotovideo.com/c/product/1746371-REG/elgato_10gbd9901_stream_deck.html/?ap=y&#038;ap=y&#038;smp=y&#038;smp=y&#038;store=420&#038;lsft=BI%3A514&#038;gad_source=1&#038;gad_campaignid=21618833212&#038;gbraid=0AAAAAD7yMh0VEsi83D_Iplpxh_yYo2kQx&#038;gclid=CjwKCAiAmp3LBhAkEiwAJM2JUOlNI_da4SWAaB2dMyMZWlt0-MdBNG2GAklhzqmxORVDynGdT4sxoRoCg6UQAvD_BwE\"> <strike>$199.99</strike> $159.99 at <strong>B&amp;H Photo</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">The dials are especially useful for controlling music. With a single dial, you skip forward or backward through a Spotify playlist, then press it to pause or play. On a standard Stream Deck, you’d need multiple buttons to do the same thing. Elgato also includes “Dial Stacks,” which let each dial handle multiple functions you can cycle through. A slim touchscreen above the dials shows what each control is currently assigned to and lets you swipe between different pages within a profile. And while the touchscreen itself can’t trigger plug-ins like the regular buttons, <a href=\"https://www.theverge.com/2024/11/7/24290619/the-stream-deck-plus-is-ready-to-get-dialed-in?utm_source=chatgpt.com\">Elgato’s since released software updates</a>  that let you assign up to three standard button or plugin actions to each dial, making the Stream Deck Plus far more useful than it was at launch.</p>",
      "author": "Sheena Vasani",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "57cbf061-bcff-40b7-bd52-5fbb0600068c",
      "title": "Verizon’s wireless network is down for many people nationwide",
      "link": "https://www.theverge.com/news/861956/verizon-is-down-outage-cell-wireless-service-sos-mode",
      "published": "2026-01-14T21:40:10+00:00",
      "summary": "The first big outage of 2026 is here, as Verizon customers across the US, including several of our phones, complain that service has been spotty or nonexistent starting at around noon ET, with phones switching to SOS Mode and being unable to connect. This cell service outage follows a \"software issue\" that cut off service [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/STK066_VERIZON_A-1.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">The first big outage of 2026 is here, as Verizon customers across the US, including several of our phones, complain that service has been spotty or nonexistent starting at around noon ET, with phones switching to SOS Mode and being unable to connect.</p>\n<p class=\"has-text-align-none\">This cell service outage follows a \"software issue\" that cut off service for many people <a href=\"https://www.theverge.com/verizon/768450/verizon-is-down-outage-network-software-issue\">in August for several hours</a>, and while Verizon has acknowledged the issue, there is no word yet on when it will be fixed.</p>\n<p class=\"has-text-align-none\"><a href=\"https://x.com/VerizonNews/status/2011500483072954495\">Verizon</a>:</p>\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-text-align-none\">We are aware of an issue impacting wireless voice and data services for some customers. Our engineers are engaged and are working to identify and solve the issue quickly. We  …</p></blockquote>\n<p><a href=\"https://www.theverge.com/news/861956/verizon-is-down-outage-cell-wireless-service-sos-mode\">Read the full story at The Verge.</a></p>",
      "author": "Richard Lawler",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "631f8a4c-d72b-4731-98c7-2ac56416f598",
      "title": "Naya Connect is a modular mechanical keyboard system for the indecisive",
      "link": "https://www.theverge.com/news/862123/naya-connect-modular-mechanical-keyboard-kickstarter",
      "published": "2026-01-14T21:38:30+00:00",
      "summary": "Naya has already shipped one successful Kickstarter for a weird keyboard. The Naya Create was an ergonomic split deck with four swappable controller addons: a touchpad, a trackball, a rotary encoder, or a 6DoF spatial mouse. The Connect takes that modular concept, applies it to a more traditional flat keyboard form factor, and expands the [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/Copy-of-1.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Naya has already shipped one successful Kickstarter for a weird keyboard. The<a href=\"https://www.kickstarter.com/projects/naya-create/naya-create/description\"> Naya Create</a> was an ergonomic split deck with four swappable controller addons: a touchpad, a trackball, a rotary encoder, or a 6DoF spatial mouse. The<a href=\"https://www.kickstarter.com/projects/naya-create/naya-connect/description\"> Connect</a> takes that modular concept, applies it to a more traditional flat keyboard form factor, and expands the ecosystem to be even more flexible. And clearly, people are into the idea, because it hit its minuscule funding goal in just six minutes.</p>\n<p class=\"has-text-align-none\">The Naya Connect has four main components: a low-profile 75%  mechanical keyboard called the Naya Type, a 24-key multipad, a six-key programmable strip, and a dock. The  …</p>\n<p><a href=\"https://www.theverge.com/news/862123/naya-connect-modular-mechanical-keyboard-kickstarter\">Read the full story at The Verge.</a></p>",
      "author": "Terrence O’Brien",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "8a361614-aed2-4612-99e5-73878fc57530",
      "title": "Amazon didn’t have to go far to find its live-action Kratos",
      "link": "https://www.theverge.com/games/862089/god-of-war-kratos-casting-amazone-prime-video",
      "published": "2026-01-14T20:47:08+00:00",
      "summary": "Amazon has announced the first cast member of its God of War live-action adaptation on Prime Video. Ryan Hurst, known for his work as Opie in Sons of Anarchy and Beta in The Walking Dead, will play the titular God of War, Kratos. Though the casting might come as a bit of a disappointment to [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/GOW_-_RH__K.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Amazon has announced <a href=\"https://press.amazonmgmstudios.com/us/en/press-release/ryan-hurst-tapped-to-play-kratos-in-prime-videos-i\">the first cast member of its <em>God of War</em> live-action adaptation on Prime Video</a>. <a href=\"https://www.imdb.com/name/nm0403652/\">Ryan Hurst</a>, known for his work as Opie in <em>Sons of Anarchy</em> and Beta in <em>The Walking Dead</em>, will play the titular <em>God of War</em>, Kratos. Though the casting might come as a bit of a disappointment to the fans hopeful that <a href=\"https://www.theverge.com/2021/9/30/22702435/kratos-voice-actor-behind-sony-god-of-war-ragnarok-delay-ps5\">Christopher Judge</a>, Kratos' award-winning voice actor in the games, might have been tapped for the role in some fashion, Hurst has familiarity with series. He voiced Thor in <em>God of War: Ragnarok</em> and <a href=\"https://www.bafta.org/awards/games/?award-year=2023\">earned a BAFTA nomination</a> for the performance.</p>\n<p class=\"has-text-align-none\">Amazon originally <a href=\"https://www.theverge.com/2022/12/14/23509418/god-of-war-amazon-prime-video-tv-show-series\">announced the <em>God of War </em>series in 2022</a> in collaboration with PlayStati …</p>\n<p><a href=\"https://www.theverge.com/games/862089/god-of-war-kratos-casting-amazone-prime-video\">Read the full story at The Verge.</a></p>",
      "author": "Ash Parrish",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "8ddbb6c6-824a-4100-a846-8ae3c96f53de",
      "title": "BMW says electric M3 will be a ‘new level’ of performance",
      "link": "https://www.theverge.com/news/861955/bmw-m3-electric-ev-quad-motor-neue-klasse",
      "published": "2026-01-14T19:30:29+00:00",
      "summary": "BMW teased its forthcoming all-electric M-series performance sedan today, promising that the quad-motor M3 sports car would feature specs that are truly next level when it arrives in 2027. The M3 will have four electric motors and simulated gear shifting, a feature that is quickly becoming a must-have for electrified sports cars. BMW says the [&#8230;]",
      "content": "<figure>\n\n<img alt=\"photo of BMW M3 EV\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/P90627558-highRes.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">BMW teased its forthcoming all-electric M-series performance sedan today, promising that the quad-motor M3 sports car would feature specs that are truly next level when it arrives in 2027. </p>\n<p class=\"has-text-align-none\">The M3 will have four electric motors and simulated gear shifting, a feature that is quickly becoming a must-have for electrified sports cars. BMW says the setup unlocks the benefits of both rear and all-wheel drive, with the ability to decouple the front axle.</p>\n<p class=\"has-text-align-none\">Four motors, though, is a bit of an outlier in the performance world. Tri-motors, sure, you can find plenty, like <a href=\"https://www.theverge.com/2021/1/27/22252832/tesla-model-s-redesign-plaid-mile-range-interior-refresh\">Tesla Model S Plaid</a> and <a href=\"https://www.theverge.com/2022/8/19/23312956/lucid-air-sapphire-edition-speed-ev-specs-monterey\">Lucid Air Sapphire</a>. But four motors are bit a rarer: the  …</p>\n<p><a href=\"https://www.theverge.com/news/861955/bmw-m3-electric-ev-quad-motor-neue-klasse\">Read the full story at The Verge.</a></p>",
      "author": "Andrew J. Hawkins",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "31dd08b4-60d6-461a-9fd9-ab8a18e48513",
      "title": "I’ve tested 30 smart locks, and these are the best",
      "link": "https://www.theverge.com/23393163/best-smart-door-lock",
      "published": "2026-01-14T19:27:00+00:00",
      "summary": "A smart lock is an easy solution to some common problems. Locked yourself out? Need to let a friend in to water the plants? Your latchkey kid lost their key? Hands are full, and it’s raining cats and dogs? A smart lock solves all of these problems and more. One of the best smart home [&#8230;]",
      "content": "<figure>\n\n<img alt=\"Door locks on a purple and yellow graphic.\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/257776_Smart_lock_buying_guide_CVirginia3.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">A smart lock is an easy solution to some common problems. Locked yourself out? Need to let a friend in to water the plants? Your latchkey kid lost their key? Hands are full, and it’s raining cats and dogs? A smart lock solves all of these problems and more.</p>\n\n<p>One of the best smart home upgrades you can make, a smart lock gives you remote control access to your house from anywhere, plus easy, key-free ways to unlock and lock your door. Smart locks also remember everything that happened, so they can tell you when your door was unlocked, and sometimes who did it.</p>\n\n<p>For most people, control and convenience are big enough selling points. However, smart locks also work nicely with other smart home devices, including <a href=\"https://www.theverge.com/22954554/best-video-doorbell-camera\">video doorbells</a> and <a href=\"https://www.theverge.com/23156554/smart-bulbs-switch-lighting-guide-how-to\">smart lighting</a>. My favorite way to integrate locks in my home is with an evening&nbsp;<a href=\"https://www.theverge.com/23749376/smart-home-explained-voice-assistant-tv-gadgets\">smart home</a>&nbsp;routine, which locks the doors, dims the lights, and sets my thermostat to sleep mode. We have four exterior doors, so it saves me from walking around the house at night checking everything is secure.</p>\n\n<p>Having a connected lock on your door is as secure as a standard lock, and sometimes more. Most smart locks have the same security ratings as their non-smart counterparts (see <a href=\"#smart-lock-faqs-1\">FAQ</a> for more details), and it&#8217;s harder to physically pick a lock without a keyway. Plus, any smart lock is more secure than leaving a spare key under a flowerpot.</p>\n\n<p>I’ve been testing smart door locks for six years and have installed more than 30 for this guide alone. Here are my top picks for your front door. Whether you want the best of the best, don&#8217;t want to replace your existing lock, are on a budget, or want a smart lock that doesn&#8217;t look like a smart lock, there are great options for every need.</p>\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<h2 class=\"wp-block-heading has-text-align-none\" id=\"best-smart-lock\">Best smart lock</h2>\n<div class=\"product-block\"><h3>Kwikset Halo Select</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/8A0A3419.jpeg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 8</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Excellent auto-unlock function</li><li>Choice of Wi-Fi or Matter-over-Thread</li><li>Great design</li><li>Discreet door sensor</li><li>Can be rekeyed</li><li></li></ul></td><td><ul><li>Have to choose between Thread and Kwikset’s auto-unlock</li><li>No Home Key or biometric access</li><li>Touchscreen shows fingerprints</li><li>Prominent Kwikset branding</li><li></li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0DJPT8KN9\"> <strike>$259</strike> $233.1 at <strong>Amazon</strong></a></li><li><a href=\"https://www.homedepot.com/pep/Kwikset-HALO-Select-Touchscreen-Wi-Fi-and-Matter-Enabled-Smart-Lock-Deadbolt-in-Matte-Black-9800-WIFI-THRD-TSCR-514/332397488\"> <strike>$259</strike> $233.1 at <strong>Home Depot</strong></a></li><li><a href=\"https://www.lowes.com/pd/Kwikset-Halo-Select-Satin-Nickel-Wifi-Single-Cylinder-Smartkey-Electronic-Deadbolt-with-Lighted-Keypad-Touchscreen/5015296445\"> $259 at <strong>Lowes</strong></a></li></ul></div>\n<p class=\"has-text-align-none\"><strong><em>Connectivity:</em></strong><em> Wi-Fi, Thread / </em><strong><em>Access options:</em></strong><em> Key, keycode, app, voice / </em><strong><em>Auto-unlock:</em></strong><em> Yes / </em><strong><em>Battery type:</em></strong><em> Four AA batteries / </em><strong><em>Battery life:</em></strong><em> Six to 12 months / </em><strong><em>Guest codes:</em></strong><em> Yes / </em><strong><em>Security rating: </em></strong><em>ANSI Grade AAA / </em><strong><em>Works with: </em></strong><em>Amazon Alexa, Google Assistant</em>, <em>Matter (including Apple Home, Samsung SmartThings)</em></p>\n\n<p class=\"has-text-align-none\">The <a href=\"https://www.theverge.com/2024/10/21/24273662/kwikset-halo-select-new-smart-lock-matter-thread-wifi\">Kwikset Halo Select</a> is a good-looking, reliable smart lock with top-notch security ratings, broad smart home compatibility, and the best auto-unlock function I’ve tested to date.</p>\n\n<p class=\"has-text-align-none\">I strongly believe a smart lock should look good on your door, and the Halo Select does exactly that, plus it can blend in with both traditional and contemporary door sets. (But I could do without the prominent Kwikset branding.)</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/8A0A3413-1.jpeg?quality=90&#038;strip=all&#038;crop=0,8.3333333333333,100,83.333333333333\" title=\"\" />\n<p class=\"has-text-align-none\">Of the four entry methods — a keyway (which is <a href=\"https://www.kwikset.com/smartkey-security\">re-keyable</a>), a touchscreen keypad, app/smart home control, and auto-unlock by location — I liked the last one the best. It worked so well that I didn’t mind that it lacks a fingerprint reader or Apple Home Key.</p>\n\n<p class=\"has-text-align-none\">My experience with automatic unlocking on other locks (which uses a combination of Bluetooth, GPS, and Wi-Fi to determine your location) has been generally frustrating, but on the Halo Select, it’s been flawless. It unlocks just as I approach my porch, making coming home and opening the door a virtually hands-free experience.</p>\n\n<p class=\"has-text-align-none\">The Select can also auto-lock based on your location, not just after a set amount of time, as most locks offer. I also like the Halo Select’s LED lock indicator on the touchscreen, which tells you at a glance if the door is locked or unlocked.</p>\n\n<p class=\"has-text-align-none\">The Halo Select has built-in Wi-Fi and a Thread radio, but you have to pick one. </p>\n\n<p class=\"has-text-align-none\">If you set it up with Wi-Fi, you can use the Kwikset app and connect to Amazon Alexa and Google via the cloud. With Matter, you can connect to those platforms locally and also to Apple Home and others, but you won’t be able to use the Kwikset app after setup, so you lose the auto-unlock feature, among others.</p>\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>Kwikset’s auto-unlock feature worked flawlessly in testing</p></blockquote></figure>\n\n<p class=\"has-text-align-none\">Matter-over-Thread does promise better battery life — and long-term testing bears this out — as well as the ability to easily share the lock with other ecosystems. I set it up in Apple Home, Google Home, and Samsung SmartThings via Matter with no issues and could control it with all three via routines, automations, and voice commands.</p>\n\n<p class=\"has-text-align-none\">It’s a shame to have to choose between using Matter and some of this lock’s best features, but this is a problem across Matter, not specific to Kwikset. Kwikset’s solution allows you to use its advanced features today while still having the future-proofing potential of Matter for tomorrow.</p>\n\n<p class=\"has-text-align-none\"><a href=\"https://www.theverge.com/smart-home/766403/kwisket-halo-select-plus-nfc-home-key-matter\">Kwikset recently launched</a> the <a href=\"https://www.amazon.com/Kwikset-Touchscreen-Deadbolt-Intrusion-Detection/dp/B0FP7PBL1F\">Halo Select Plus</a>, which we’re currently testing. This adds Apple Home Key support, but at $329, you’re paying a lot more for this one added function. Other recent updates include new finishes for the Halo Select line.</p>\n\n<h5 class=\"wp-block-heading has-text-align-none\" id=\"read-my-full-review-of-the-kwikset-halo-select\"><a href=\"https://www.theverge.com/smart-home-review/679903/kwikset-halo-select-smart-lock-review\">Read my review of the Kwikset Halo Select</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"UODcx4\">Best budget smart(ish) lock</h2>\n<div class=\"product-block\"><h3>Wyze Lock Bolt</h3>\n<div class=\"product-description\">This inexpensive smart door lock has a lightning-fast fingerprint reader plus an easy-to-use, backlit keypad. It’s Bluetooth-only (unless you also buy its compatible video doorbell to act as a Wi-Fi bridge), so the battery lasts over a year. At under $80, it’s the best budget lock we tested.</div>\n<figure class=\"product-image\"><img alt=\"A keypad door lock on a door\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24050206/226293_SMART_LOCK_BUYING_GUIDE_jtuohy_0020.jpg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 7</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Inexpensive </li><li>Good fingerprint reader</li><li>Offline access codes</li><li>Long battery life</li><li></li></ul></td><td><ul><li>No Wi-Fi </li><li>No smart home support</li><li>Large rear housing</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.homedepot.com/pep/Wyze-Smart-Lock-Fingerprint-Keyless-Entry-Bluetooth-Deadbolt-Replacement-In-App-Monitoring-and-Scheduled-Access-WLCKB1/320791492\"> <strike>$79.98</strike> $65.75 at <strong>Home Depot</strong></a></li><li><a href=\"https://www.amazon.com/Fingerprint-Bluetooth-Replacement-Weatherproof-Scheduled/dp/B0BMZMF26G\"> <strike>$79.98</strike> $65.75 at <strong>Amazon</strong></a></li><li><a href=\"https://www.wyze.com/products/wyze-lock-bolt/\"> $79.98 at <strong>Wyze</strong></a></li></ul></div>\n<p><em><em><strong>Connectivity:</strong> Bluetooth 5.0  / <strong>Access options:</strong> Fingerprint, keypad, app / <strong>Auto-unlock:</strong> No / <strong>Battery type: </strong>Four AA batteries  / <strong>Battery life:</strong> One year / <strong>Security Grade:</strong> ANSI/BHMA Grade 3 / <strong>Guest codes:</strong> Yes / <strong>Works with:</strong> N/A</em></em></p>\n\n<p>The Wyze Lock Bolt is a good choice if you want something inexpensive and useful and don’t care about smart home integration — or prefer a lock without it. It’s not sleek or stylish; it’s just a big hunk of black plastic (there’s also a satin nickel version). Out of the box, it doesn’t connect to Wi-Fi or integrate with any smart home systems, but it does have an easy-to-use backlit keypad and a lightning-fast fingerprint reader. It’ll auto-lock if you want, and it’s half the price of most smart locks in this list.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24745153/8A0A6570.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p>In addition to the fingerprint reader and keypad, the Wyze Lock Bolt can be controlled over Bluetooth, and its range is very good. I could lock the door from my bedroom at the other end of the house using the Wyze app. That’s important, as there’s no way to lock the door on a schedule (although you can enable auto-lock).</p>\n\n<figure class=\"wp-block-pullquote alignleft\"><blockquote><p>The Wyze doesn’t connect to Wi-Fi or integrate with any smart home systems </p></blockquote></figure>\n\n<p>The Bolt doesn’t integrate with smart home platforms, but if you don’t need to control your lock with your voice or plan to add it to any smart home routines, you won’t miss those features. It also delivers up to a year of battery life on four AAs — I tested it for three months and it only lost 15 percent.</p>\n\n<p>But without Wi-Fi, I couldn’t check on it or control it when I was away from home, so turning on the auto-lock option is a must. If I wanted to let someone in while I was gone, I couldn’t unlock the door remotely, but I could generate an offline code in the Wyze app and share that. This uses similar technology to two-factor authentication codes and worked perfectly in my testing.&nbsp;</p>\n\n<p>Since I tested the lock, Wyze has introduced an integration with its <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze Video Doorbell Pro </a>that lets you unlock the Bolt remotely when paired with the doorbell — but it doesn’t let you lock it remotely, which is odd. Of course, if you enable auto-lock, this is less of an issue.</p>\n\n<h2 class=\"wp-block-heading\" id=\"54sqA6\">Best retrofit smart lock</h2>\n<div class=\"product-block\"><h3>Nuki Smart Lock</h3>\n<div class=\"product-description\">Nuki Smart Lock</div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/257834_Nuki_Smart_Lock_JTuohy_0006.jpg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 9</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Lightning fast</li><li>Nice, compact design</li><li>Simple to install</li><li>Supports Wi-Fi <em>and</em> Matter over Thread</li><li>No account required</li><li>Broad smart home compatibility</li></ul></td><td><ul><li>No Apple Home Key</li><li>Proprietary charging cable</li><li>No door sensor included</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Keyless-Electronic-Deadbolt-Auto-Unlock-Installation/dp/B0F7HKRWNV\"> $199 at <strong>Amazon</strong></a></li><li><a href=\"https://nuki.io/en-us/products/smart-lock?chooser=true&#038;sku=US-221146\"> $199 at <strong>Nuki</strong></a></li></ul></div>\n<p class=\"has-text-align-none\"><em><em><strong>Connectivity:</strong> Bluetooth, Wi-Fi, and Matter-over-Thread / <strong>Access options:</strong> Key, app, voice, fingerprint and keypad (sold separately) /  <strong>Auto-unlock:</strong> Yes / <strong>Battery type: </strong>Non-removable, rechargeable / <strong>Battery life:</strong> Up to 12 months / <strong>Guest codes:</strong> Yes / <strong>Works with: </strong>Amazon Alexa, Google Home, Apple Home, Samsung SmartThings</em></em></p>\n\n<p class=\"has-text-align-none\">The Nuki Smart Lock is the most advanced retrofit smart lock we’ve tested, and a worthy replacement for our previous pick, the <a href=\"https://www.amazon.com/dp/B082VXRND2/\">August Wi-Fi Smart Lock</a>. It features a compact design and lightning-fast locking — even quicker than manually turning the lock — and it works over Bluetooth, Wi-Fi, and <a href=\"https://www.theverge.com/24313084/smart-lock-home-preview-2025-matter-apple\">Matter over Thread</a>, the latter of which enables out-of-home control and notifications through any Matter-compatible smart home platform.</p>\n\n<p class=\"has-text-align-none\">Whereas most smart locks feature a big, bulky design, the Nuki Smart Lock boasts a minimalist style with a premium look and feel. Installation is straightforward — simply remove the thumbturn from your existing deadbolt, replace it with a blackplate, and snap the Nuki into place. Once it’s installed, you can get up and running without signing up for an account, which is a rare feature for a smart lock.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/257834_Nuki_Smart_Lock_JTuohy_0009.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p class=\"has-text-align-none\">The Nuki app gives you access to multiple settings and customization options. In addition to standard features like key sharing with family members and enabling auto-lock and auto-unlock, it supports schedules, an activity log, and a convenient Night Mode, which can lock the door at a set time, disable auto-unlock, and enable auto-lock.</p>\n\n<p class=\"has-text-align-none\">If you don’t have a Matter hub and a <a href=\"https://www.theverge.com/23823041/matter-thread-device-setup-smart-home-how-to\">Thread border router</a> — like a HomePod — Nuki’s Premium service provides remote access, lock activity notifications, and integration with rental platforms like Airbnb. Nuki Premium was previously offered as a monthly subscription, but as of December 3rd, 2025, the cost is now folded into the purchase of each lock. That means the Nuki Smart Lock is now more expensive up front at $199 (up from $159); however, the good news is that premium features are no longer behind a paywall. Those who already have Nuki Premium will also be able to continue using the premium features for the lifetime of the product without an added fee.</p>\n\n<p class=\"has-text-align-none\">Additionally, Nuki offers an <a href=\"https://www.amazon.com/dp/B0F7HLSQCG/\">optional keypad</a>, which supports both PIN codes and fingerprints, making it easy for friends, family, and guests to gain access without needing to download an app. Although the fingerprint reader works well, there is no backlight, making nighttime use tricky without a porch light. The current keypad doesn’t support Apple Home Key, though Nuki is planning to release one with <a href=\"https://www.theverge.com/smart-home/603957/uwb-hands-free-unlocking-schlage-aliro-apple-samsung-hands-on?gclid=Cj0KCQjwjo7DBhCrARIsACWauSlNtfG8MdSub86eRemLyhXGwTJDBlJocAHan9rW73u3L3JsAARDL_caAqYPEALw_wcB&amp;gbraid=0AAAAA9k5E7D4IShVDiE_Pj3tXHaohe7KM\">ultra-wideband unlocking (UWB)</a> and NFC support.</p>\n\n<p class=\"has-text-align-none\">Nuki’s smart lock has a built-in battery that can last for months, and it only takes a few hours to fully recharge. While a non-removable battery raises concerns about longevity — smart locks generally use AA batteries — Nuki claims it should last 10 years. After that, the company says a replacement plan will be offered.</p>\n\n<h5 class=\"wp-block-heading\" id=\"0OPJqL\"><a href=\"https://www.theverge.com/smart-home-review/695965/nuki-smart-lock-review\">Read our review of the Nuki Smart Lock</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"yynwaS\">Best smart lock for renters</h2>\n<div class=\"product-block\"><h3>Yale Approach Lock with Wi-Fi</h3>\n<div class=\"product-description\">This slimline, easy-to-install, inexpensive retrofit lock is a simple solution with a year of battery life. It requires a plug-in bridge for out-of-home control and doesn’t work with Apple Home. The optional keypad adds to the cost but also to the convenience. </div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25662589/8A0A1898.jpeg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 7</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Easy install</li><li>Option of fingerprint keypad</li><li>A year of battery life</li></ul></td><td><ul><li>Requires Wi-Fi bridge</li><li>Keypad is big and ugly</li><li>No support for Matter</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Yale-Approach-Deadbolt-Retrofit-Unlimited/dp/B0CWWF7CWR\"> <strike>$129.99</strike> $79.98 at <strong>Amazon</strong></a></li><li><a href=\"https://shopyalehome.com/pages/yale-approach-lock-with-wi-fi\"> $239.99 at <strong>Yale (with fingerprint keypad)</strong></a></li></ul></div>\n<p><em><em><strong>Connectivity:</strong> Bluetooth and Wi-Fi (with plug-in module) / <strong>Access options:</strong> Key, app, voice, keypad and fingerprint reader sold separately / <strong>Auto-unlock:</strong> Yes / <strong>Battery type:</strong> Four AA alkaline batteries / <strong>Battery life: </strong>12 months / <strong>Guest codes:</strong> Yes / <strong>Works with: </strong>Amazon Alexa, Google Home, Samsung SmartThings</em></em></p>\n\n<p>Starting at $130, the Yale Approach is a more affordable retrofit lock with no monthly subscription. It’s super easy to install, looks nice, and has a good list of features — auto-lock, auto-unlock, app and voice control. Add the Bluetooth keypad to get one-touch locking, key code, and fingerprint access.</p>\n\n<p>The Approach replaces your thumb turn, so you can still use your current lock and key — making it a great option if you are renting and don’t want to annoy your landlord. It has a nice, slim profile and blends in better than the rear housing of most smart locks.</p>\n\n<p>The lock comes in black or silver and took me less than five minutes to install. It uses four AA batteries and promises 12 months of battery life. This is because there is no built-in Wi-Fi; instead, it uses an included plug-in bridge.</p>\n\n<p>The bridge adds out-of-home control and connection to smart home platforms, including Alexa and Google Home, but there’s no Apple Home support). This allows for voice control and adding it to smart home routines. Yale told me there’s an onboard <a href=\"https://www.theverge.com/2024/4/11/24126764/yale-approach-smart-lock-price-release-date-specs#:~:text=Daviau%20also%20said,with%20Matter%20later.%E2%80%9D\">Thread radio</a> that will be activated to support Matter, but didn’t say when this would arrive.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25658974/8A0A1825.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p>The optional Bluetooth keypad lets you control the lock from the outside without using an app or key, and it worked promptly and reliably. There’s the option of a fingerprint version, and that was similarly a good experience — just touch and open. The keypad also allows you to lock the door when you leave by pressing the Yale logo button. </p>\n\n<p>The keys are a bit sensitive; I frequently get double inputs when pressing. But I liked the LED indicator that notifies you with green if your code was accepted or red if there’s an issue. This made it easy to know if the input worked, as the lock is very quiet — it’s hard to hear it locking or unlocking.</p>\n\n<p>My biggest disappointment is the look of the keypad. It’s big, wide, and black, with prominent white numbers that don’t disappear when not in use — it looks a bit like a toy keypad on your door.</p>\n\n<h2 class=\"wp-block-heading\" id=\"CMVNGj\">Best fingerprint smart lock</h2>\n<div class=\"product-block\"><h3>Yale Assure Lock 2 Touch</h3>\n<div class=\"product-description\">This fingerprint lock is fast and reliable, and the keypad is a good backup option for visitors. It works with Apple Home and can be upgraded to support Wi-Fi — which you’ll need for remote unlocking, Android phones, Amazon Alexa, and Google Home support. Auto-unlock can open the door as you approach, and you can also use a key if you just can’t let go.</div>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24970263/236819_Yale_Assure_Lock_2_JTuohy_0003.jpg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 8</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Fast fingerprint reader</li><li>Nice, compact design</li><li>Works with Apple Home</li><li>Compatible with Wi-Fi and Z-Wave</li></ul></td><td><ul><li>Touchscreen isn’t intuitive</li><li>Auto-unlock can be slow / unreliable</li><li>No Matter support</li><li>Prominent Yale branding</li><li>Additional connectivity options cost extra</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Yale-Assure-Key-Free-Keypad-Bluetooth/dp/B0D96ZLD4C\"> <strike>$189.99</strike> $158.77 at <strong>Amazon (Bluetooth)</strong></a></li><li><a href=\"https://www.amazon.com/Yale-Security-Connected-Fingerprint-YRD410-F-WF1-619/dp/B0D96YJWPL\"> <strike>$269.99</strike> $242.99 at <strong>Amazon (Wi-Fi)</strong></a></li></ul></div>\n<p><em><em><strong>Connectivity:</strong> Bluetooth (can add Wi-Fi, Z-Wave) / <strong>Access options:</strong> Key, keypad, fingerprint reader, app, voice / <strong>Auto-unlock:</strong> Yes / <strong>Battery type:</strong> Four AA batteries / <strong>Battery life: </strong>Six months to a year / <strong>Guest codes:</strong> Yes / <strong>Security rating:</strong> ANSI/BHMA Grade 2 / <strong>Works with: </strong>Apple Home, Amazon Alexa, Google Home, Samsung SmartThings</em></em></p>\n\n<p>The Yale Assure 2 line — previously my top pick — has something for everyone. There’s an option with or without a keyway, with a touchscreen keypad or a physical keypad, or with <a href=\"https://www.amazon.com/Yale-Assure-Lock-Apple-Wi-Fi/dp/B0CBNF2M6F?tag=theverge02-20&amp;ascsubtag=___vg__p_23131505__t_w__r_https://www.theverge.com/23393163/best-smart-door-lock__d_D\">Apple Home Key</a>, but my favorite model is the Yale Assure Lock 2 Touch with a built-in fingerprint reader. It costs $279.99, and the built-in fingerprint reader is fast and efficient. I tested the touchscreen version, but Yale recently released <a href=\"https://shopyalehome.com/pages/yale-assure-lock-2-touch\">a keypad version</a>. Unless you really value the clean look of the touchscreen (which is blank when off), go with the keypad — it’s much easier to use.</p>\n\n<p>The Yale Assure 2 is a good-looking lock that works with every smart home platform with its swappable modules. Its slimline design (both front and back), wide smart home compatibility, easy-to-use app, and good selection of unlocking options — including fingerprint unlock — make it a great option for your front door.&nbsp;</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/236819_Yale_Assure_Lock_2_JTuohy_0004.webp?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p>The lock supports Bluetooth out of the box and works with the Yale Access app and Apple Home app (which adds remote unlocking if you have an Apple Home hub). Along with a keycode, fingerprint reader, or key, you can also choose to use auto-unlocking. Auto-unlock is a decent alternative to fingerprint unlock, but I found I often had to wait at the door for a second or two before it worked. Still, it’s faster than fumbling through a purse for keys when your hands are full.</p>\n\n<p>Support for other platforms and remote unlocking comes through Yale’s ingenious swappable networking modules, which cost around $80 each. There’s a Wi-Fi module to add Alexa and Google Home integration and a <a href=\"https://www.yalehome.com/us/en/stories/news/z-wave-now-available-with-yale-assure-lock--2\">Z-Wave module</a> for compatibility with (some) SmartThings hubs, <a href=\"https://www.theverge.com/22798830/ring-alarm-pro-review-smart-home-security-alexa\">Ring Alarm</a>, and other Z-Wave hubs. Yale promised support for Matter via a Matter-over-Thread module back in 2022, but this <a href=\"https://www.theverge.com/2023/9/27/23891513/yale-assure-lock-2-touch-fingerprint-plus-homekey#:~:text=When%20we%20first,for%20early%20adopters.\">still hasn’t materialized</a>. They have announced <a href=\"https://www.theverge.com/news/638162/yale-smart-lock-with-matter-works-with-google-home\">a different lock that uses Thread</a>, but it doesn’t have a fingerprint reader. I plan to test this soon.</p>\n\n<p>I tested the <a href=\"https://shopyalehome.com/collections/accessories/products/yale-wi-fi-smart-module-for-assure\">Wi-Fi module</a> in the Assure 2 Touch, which worked well with Amazon Alexa and Google Home. It allowed me to add the lock to <a href=\"https://www.theverge.com/23312859/amazon-alexa-echo-routine-smart-speaker-how-to\">Alexa Routines</a>, lock and unlock it with my voice, and control it away from home. The downside is that control over Wi-Fi is considerably slower than over Bluetooth and drains the battery more quickly. Yale estimates up to a year on Bluetooth only, compared to six months over Wi-Fi; I got about four months.</p>\n\n<h5 class=\"wp-block-heading\" id=\"g2gz2L\"><a href=\"https://www.theverge.com/23367464/yale-assure-lock-2-touchscreen-keypad-wifi-review\">Read my review of the Yale Assure Lock 2 Touch</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"xMDzMI\">Best smart lock that works with Apple Home Key</h2>\n<div class=\"product-block\"><h3>Schlage Encode Plus</h3>\n<div class=\"product-description\">The Encode Plus is a high-end, reliable smart lock that works with Apple Home and has Home Key compatibility. It also has a Thread radio on board, which helps with connectivity and battery life.</div>\n<figure class=\"product-image\"><img alt=\"An iPhone being used to unlock the Schlage Encode Plus smart lock.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/23241990/dseifert_220211_5018_0009.jpg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 8</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Support for Apple Home and Home Key</li><li>Works over Thread</li><li>Easy-to-use keypad</li><li>Nice design options that may match your hardware</li></ul></td><td><ul><li>Expensive</li><li>Quite loud</li><li>No Matter support</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Schlage-BE499WB-CAM-619-Deadbolt/dp/B09RS1Z1ZN\"> <strike>$329.99</strike> $259 at <strong>Amazon</strong></a></li><li><a href=\"https://www.homedepot.com/p/Schlage-Camelot-Satin-Nickel-Electronic-Encode-Plus-Smart-WiFi-Deadbolt-with-Alarm-BE499WB-CAM-619/318244332\"> <strike>$329</strike> $259 at <strong>The Home Depot</strong></a></li><li><a href=\"https://www.build.com/schlage-be499wb-cen/s1817998/\"> $297.09 at <strong>Build</strong></a></li></ul></div>\n<p><em><em><strong>Connectivity:</strong> Wi-Fi or Thread / <strong>Access options:</strong> Key, keypad, app, voice, Apple Home Key / <strong>Auto-unlock:</strong> No / <strong>Battery type: </strong>Four AA batteries / <strong>Battery life:</strong> Up to six months / <strong>Security Grade:</strong> ANSI Grade 1 / <strong>Guest codes:</strong> Yes / <strong>Works with: </strong>Apple Home Key, Amazon Alexa, Ring, and Google Home</em></em></p>\n\n<p><a href=\"https://support.apple.com/guide/iphone/unlock-your-door-with-a-home-key-iph0dc255875/ios\">Apple Home Key</a> lets you use your iPhone or Apple Watch to tap to unlock your door in much the same way as you tap to pay. It uses an NFC chip in the lock, and is fast, efficient, and secure. There are no apps to open, no buttons to press, and no need to unlock your phone (although you can add that step as an extra security layer). However, it does require an Apple device; it won’t work on Android. </p>\n\n<p>Home Key took a while to gain adoption, but there are now several options (and should soon be more as <a href=\"https://www.theverge.com/2023/6/8/23753915/matter-smart-lock-aqara-u100-apple-home-key#:~:text=Home%20Key%20will%20come%20to%20Matter%20locks%20in%20iOS17\">Apple has made it part of Matter</a>). The Schlage Encode Plus is still the best option — if one of the most expensive — as it has a built-in keypad and works over Thread. </p>\n<img alt=\"A close up of a touchscreen door lock\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/23241985/dseifert_220211_5018_0004.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"A close up of a touchscreen door lock\" />\n<p>The keypad is useful for giving access to people with whom you can’t share a Home Key (sharing is quite limited), and Thread makes for a rock-solid connection. While it won’t be updated to support Matter, the Thread radio adds better battery life and a more stable connection to Apple Home than Bluetooth. I have had numerous connectivity issues in HomeKit with Bluetooth-only locks.</p>\n\n<p>To use Home Key, you need to have an Apple Home Hub, such as an Apple TV or HomePod. Adding the lock to the Home app automatically adds the Home Key card to your Wallet, as well as that of anyone else you have added to your Apple Home. That’s much easier than getting household members to download a whole new app for the door lock. I should know — I try regularly. </p>\n\n<p>To allow someone not in your household to control the lock, you’ll have to give them a standard PIN, which you can do in the Apple Home app or the Schlage Encode app. If you like, you can set this lock up entirely in the Home app and never have to use the manufacturer’s app.&nbsp;</p>\n\n<h5 class=\"wp-block-heading\" id=\"q0sOzQ\"><a href=\"https://www.theverge.com/22964521/schlage-smart-lock-review-encode-plus-apple-home-key-test\">Read our review of the Schlage Encode Plus</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"qBu5u5\">Best smart lock that doesn’t look like a smart lock</h2>\n<div class=\"product-block\"><h3>Level Lock Pro</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/Level_Lock_Pro_Exterior_Nickel_1.jpg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 8</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>No branding</li><li>Small and unobtrusive</li><li>Supports Home Key</li><li>Works over Thread</li><li>Broad smart home compatibility through Matter</li><li>Door sense</li></ul></td><td><ul><li>Expensive</li><li>Keypad costs extra</li><li>Auto-unlock can be unreliable</li><li>Not ideal for older doors</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://level.co/products/level-lock/pro/\"> $349 at <strong>Level</strong></a></li></ul></div>\n<p><span><em><strong>Connectivity:</strong> Bluetooth, Thread, Wi-Fi with bridge / <strong>Access options:</strong> Key, app, voice, keypad (sold separately), Apple Home Key / <strong>Auto-unlock:</strong> Yes / <strong>Battery type:</strong> One CR2 batter</em><i>y / </i><strong>Battery life:</strong><i> 12 months / </i><strong>Guest codes:</strong><i> Yes / </i><strong><i>Works with: </i></strong></span><em>Matter, </em><span><i>Apple Home</i></span><em>, Google Home, Amazon Alexa, Samsung SmartThings</em></p>\n\n<p>If you don’t want a smart lock that <em>looks</em> like a smart lock, there’s the Level Lock Pro. It doesn’t feature a chunky battery box or prominent branding, yet it packs a ton of technology inside the footprint of a traditional lock. The newer model features an upgraded processor, Matter-over-Thread support, a passive infrared sensor for presence detection, and a built-in door sensor to tell you if the door is open or closed, not just locked. It also comes in one of two discreet finishes, matte black or nickel, and offers up to a year of battery life with a single CR2.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/8A0A3980-1.jpeg?quality=90&#038;strip=all&#038;crop=0.0046641791044806,0,99.990671641791,100\" title=\"\" />\n<p>In terms of execution, the faster dual-core Bluetooth/Thread chip delivers more reliable performance than earlier models — including our former pick, the Level Lock Plus — and the lock offers support for multiple access options. You can unlock the Lock Pro with a regular key, Apple Home Key, the Level app, voice control, auto-unlock, or a touch-to-unlock mode. We found the auto-unlock feature to be finicky at times, though, and the installation can be a headache on older doors. It’s also pricey, starting at $349 (plus an optional $79 <a href=\"https://level.co/products/connect-wifi-bridge/\">Wi-Fi bridge</a>).</p>\n\n<p>That said, if you want a lock that offers premium features and a sleek design, the Lock Pro feels like the brand’s most fully realized vision of what a minimalist smart lock should be.</p>\n\n<h5 class=\"wp-block-heading\" id=\"XNWo1W\"><a href=\"https://www.theverge.com/hands-on/765571/level-lock-pro-hands-on-review-apple-home-key-matter-thread\">Read our hands-on impressions of the Level Lock Pro</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"Y1vcAb\">Best smart lever lock</h2>\n<div class=\"product-block\"><h3>Aqara Smart Lock U300</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25659014/8A0A1868.jpeg?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Aqara-Fingerprint-Keyless-Touchscreen-Supports/dp/B0D496H9YV\"> <strike>$229.99</strike> $179.99 at <strong>Amazon</strong></a></li><li><a href=\"https://www.bestbuy.com/product/aqara-smart-lock-u300-matter-over-thread-lever-set-with-touchpad-nfc-auto-lock-home-key-fingerprint-bluetooth-key-access-black/JJ8RHCJ2FC\"> <strike>$229.99</strike> $199.99 at <strong>Best Buy</strong></a></li></ul></div>\n<p><em><em><strong>Connectivity:</strong> Thread / <strong>Access options:</strong> Key, app, voice, keypad, NFC tag, Apple Home Key / <strong>Auto-unlock:</strong> No / <strong>Battery type:</strong> Four AA batteries</em> <em>/ <strong>Battery life:</strong> 10 months / <strong>Guest codes:</strong> Yes / <strong>Works with: </strong>Matter, Apple Home, Amazon Alexa, Google Home, Samsung SmartThings</em></em></p>\n\n<p>The Aqara U300 is a lever-style smart lock; it replaces a knob or lever lock on a door with a single borehole rather than a door with a deadbolt lock with two holes. This type of lock is traditionally found on interior doors, pedestrian doors into garages, or side doors.</p>\n\n<p>There are options for smart lever locks from <a href=\"https://www.bestbuy.com/site/yale-assure-lock-smart-lock-wi-fi-lever-with-touchscreen-keypad--key-access-black-suede/6563911.p?skuId=6563911&amp;extStoreId=1120&amp;utm_source=feed&amp;ref=212&amp;loc=19626625157&amp;gad_source=1&amp;gclid=Cj0KCQjwpP63BhDYARIsAOQkATYez6qqP87kqpgI7KxulDSAaGklzF8tVZdPR-8cgKceOAcRZINDPVgaApWuEALw_wcB&amp;gclsrc=aw.ds\">Yale</a>, <a href=\"https://www.homedepot.com/p/Schlage-Century-Satin-Nickel-Electronic-Encode-Smart-WiFi-Latitude-Lever-with-Alarm-FE789WB-CEN-619-LAT/325030973?irgwc=1&amp;cm_mmc=afl-ir-78091-456723-&amp;clickid=WiW1Dq3bRxyIWUpT3wROLUykUkCUB3wVyQbsxU0\">Schlage</a>, and <a href=\"https://go.skimresources.com?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Flockly.com%2Fproducts%2Flockly-secure-plus\">Lockly</a>, but the U300 is the only one with Home Key compatibility and a built-in fingerprint reader. It also works over Thread and supports Matter.</p>\n\n<p>I installed it on my garage door, and it works like a charm. The fingerprint reader is right where you put your thumb to open the door, so I barely notice it unlocking as I walk in. It also has a keypad, and I can use my iPhone or Apple Watch for Home Key. It’s set to auto-lock by default, but you can enable passage mode directly on the lock if you don’t want it to stay locked all the time.</p>\n\n<p>It paired to Matter easily — I set it up in Apple Home and could add a code and Home Key all without even opening the Aqara app. Because it uses Thread, there’s no need for an Aqara hub. Thread also enables up to 10 months of battery life, according to Aqara.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25659184/8A0A1872.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p>I love the idea of using smart locks on other doors in my home. I could see this working on a basement door, a home office, or any other room you like to keep people out of. However, I would like to see a way to permanently enable passage mode. Currently, you have to do it on the device, and it reverts to auto-lock after an undetermined period. This makes it somewhat useless for interior doors. It’s also very large and only comes in black or silver, so it likely wouldn’t blend in with your interior decor. A slimmer option, in more colorways, designed for inside use would be nice to see.</p>\n\n<p>The U300 is expensive at $230, but it&#8217;s similar to other outdoor-rated options (it’s IPX4-rated). The addition of Thread — a protocol that works over a mesh network — makes it easier to extend connectivity further to places like a shed or garage.</p>\n\n<h2 class=\"wp-block-heading\" id=\"best-smart-lock-that-s-also-a-video-doorbell\">Best smart lock that’s also a video doorbell</h2>\n<div class=\"product-block\"><h3>Eufy FamiLock S3 Max</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/8A0A3476.jpeg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 7</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Digital peephole is useful</li><li>Palm unlock is fast</li><li>No subscription fees for video</li><li>Lock supports Matter</li><li>Facial recognition with HomeBase</li></ul></td><td><ul><li>Very expensive</li><li>Nighttime video is not great</li><li>No package detection</li><li>HomeBase required for most smart alerts</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0DTHMFMKP\"> <strike>$399.99</strike> $349.99 at <strong>Amazon (with coupon)</strong></a></li><li><a href=\"https://www.eufy.com/products/e85v0jy1\"> <strike>$399.99</strike> $349.99 at <strong>Eufy</strong></a></li><li><a href=\"https://www.homedepot.com/p/eufy-S3-Max-Black-Thumb-Turn-Smart-Lock-Deadbolt-with-2K-Video-Doorbell-and-Palm-Scan-Compatible-with-Smart-Devices-E85V0JY1/334469125\"> $399.99 at <strong>The Home Depot</strong></a></li></ul></div>\n<p class=\"has-text-align-none\"><strong><em>Connectivity:</em></strong><em> Wi-Fi or Eufy HomeBase / </em><strong><em>Access options:</em></strong><em> Key, palm unlock, keypad, app, voice / </em><strong><em>Auto-unlock:</em></strong><em> No / </em><strong><em>Battery type:</em></strong><em> Removable, rechargeable lithium-ion battery, AAA backup / </em><strong><em>Battery life:</em></strong><em> Five months / </em><strong><em>Guest codes:</em></strong><em> Yes / </em><strong><em>Security rating:</em></strong><em> ANSI Grade 1 / </em><strong><em>Works with: </em></strong><em>Matter (including Apple Home), Amazon Alexa, and Google Home</em></p>\n\n<p class=\"has-text-align-none\">Eufy’s new FamiLock S3 Max combines a smart lock and <a href=\"https://www.theverge.com/22954554/best-video-doorbell-camera#zVdu3s\">video doorbell</a> in one device and features a digital peephole and a wave-to-unlock function. It also has a keyway and keypad and supports Matter-over-Wi-Fi, so it can work with all the major smart home platforms.</p>\n\n<p class=\"has-text-align-none\">My favorite of all these features is the video screen on the inside part of the lock, which shows a live feed of who is on the other side of the door. If you have a peephole or a window in your door, this might not be much use — and you can opt to get the lock without the screen for $50 less. But as a quick way to confirm who is at your door before opening it, it&#8217;s super handy.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/8A0A3494.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p class=\"has-text-align-none\">The lock has another fairly unique feature: <a href=\"https://securityjournalamericas.com/palm-vein-scanning\">palm vein recognition technology</a>. This lets you wave your hand over it to unlock it, and is an alternative form of biometric access to the popular fingerprint reader.</p>\n\n<p class=\"has-text-align-none\">Palm unlocking isn’t any faster or easier than using your fingerprint, though, and I found it harder to get used to. But once I got the hang of it, it worked reliably. Both my kids also picked it up quickly, and my husband, who has trouble with fingerprint locks in general, really liked it.</p>\n\n<p class=\"has-text-align-none\"><span>The </span>main reason to buy this lock is for the video doorbell feature. The FamiLock’s 2K camera provides clear, crisp video during daylight hours and decent night vision, although my protruding door frame reflected the LEDs, causing the footage to blow out a bit.</p>\n\n<p class=\"has-text-align-none\">The 180-degree diagonal field of view meant I could see top to bottom and all of one side (not the other side, though, due to the aforementioned door frame). But packages and people were clearly visible, which is most of what you want to see with a doorbell camera.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/8A0A3480.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p class=\"has-text-align-none\">There’s no fee for viewing recorded footage of visitors in the Eufy app, and videos are stored locally on the device. Live view and recording pulled up promptly in the app, and the doorbell can alert you when it sees a person. For more advanced smart alerts, including facial recognition, you need to connect it to a <a href=\"https://go.skimresources.com?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Fwww.eufy.com%2Fproducts%2Ft80301d1%3Fvariant%3D41846278357178\">Eufy HomeBase</a>.</p>\n\n<p class=\"has-text-align-none\">Bear in mind, Matter integration only controls the lock, as cameras aren’t supported by the standard yet, so the benefits of using Matter are fairly limited. (<span>If you’re looking for a biometric Matter lock,&nbsp;<a href=\"https://go.skimresources.com?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Fwww.eufy.com%2Fproducts%2Ft85f1111%3Fvariant%3D44170332307642\" rel=\"noreferrer noopener\" target=\"_blank\">Eufy’s E30 is a good fingerprint lock that uses Matter-over-Thread</a></span>.)</p>\n\n<p class=\"has-text-align-none\">Adding a video doorbell to a smart lock puts a lot of strain on the battery. While you can adjust several settings to help save power, Eufy says you’ll only get about five months of battery life from the lock’s giant 15,000mAh removable battery. Handily, four AAA backup batteries are tucked into the top to keep it functioning while you’re recharging the battery (which takes a while). I’ve been testing it for over a week, and the battery indicator hasn’t budged yet.</p>\n\n<p class=\"has-text-align-none\">At $400, this is a very expensive lock, but it works well and provides dual functionality of a doorbell and door lock.</p>\n\n<h5 class=\"wp-block-heading has-text-align-none\" id=\"read-my-review-of-the-eufy-familock-s3-max\"><a href=\"https://www.theverge.com/\">Read my review of the Eufy FamiLock S3 Max</a>.</h5>\n\n<h2 class=\"wp-block-heading\" id=\"best-facial-recognition-smart-lock\">Best facial recognition smart lock</h2>\n<div class=\"product-block\"><h3>Lockly Visage</h3>\n<figure class=\"product-image\"><img alt=\"\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/8A0A3474.jpeg?w=300\" width=\"300\" /></figure>\n<div class=\"product-scores\"><h4>Score: 8</h4><table class=\"product-pros-cons\"><thead><tr><th>Pros</th><th>Cons</th></tr></thead><tbody><tr><td><ul><li>Facial recognition is super fast</li><li>Home Key <em>and</em> a fingerprint reader</li><li>Compact design</li><li>Comes with two rechargeable batteries</li></ul></td><td><ul><li>Keypad is hard to see, fiddly to use</li><li>Wired door sensor is ugly</li><li>No support for Matter</li></ul></td></tr></tbody></table></div>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/Lockly-Recognition-Fingerprint-Deadbolt-Installation/dp/B0DRXF5NKL\"> $349 at <strong>Amazon</strong></a></li><li><a href=\"https://www.homedepot.com/pep/Lockly-Visage-Facial-Recognition-Zeno-Matte-Black-Deadbolt-Wi-Fi-Smart-Lock-Home-Key-Fingerprint-Keypad-Siri-Alexa-Google-PGK728WRHKMB/329236400?g_store=&#038;source=shoppingads&#038;locale=en-US&#038;pla&#038;utm_source=google&#038;utm_medium=vantage&#038;utm_campaign=62027&#038;utm_content=64557&#038;mtc=SHOPPING-RM-RMP-GGL-D25H-Multi-NA-LOCKLY-NA-PMAX-NA-NA-MK717879001-62027-NBR-23664-NA-VNT-FY25_Q1_Q4_PINGENIEINCLOCKLY_D25H_RM_ES_AON_BAUOpportunity&#038;cm_mmc=SHOPPING-RM-RMP-GGL-D25H-Multi-NA-LOCKLY-NA-PMAX-NA-NA-MK717879001-62027-NBR-23664-NA-VNT-FY25_Q1_Q4_PINGENIEINCLOCKLY_D25H_RM_ES_AON_BAUOpportunity-22475771654--&#038;gad_source=1&#038;gad_campaignid=22469257614&#038;gbraid=0AAAAAolLu9-ymkt2Bchzoh_9RnRqeLRbi&#038;gclid=CjwKCAjw3f_BBhAPEiwAaA3K5CsPEoMdJjWlcO8dY9NSml86Nr7I-WsInXUWIQ6qkMgG3gyfDSpnAxoCpP4QAvD_BwE&#038;gclsrc=aw.ds\"> $349 at <strong>The Home Depot</strong></a></li><li><a href=\"https://lockly.com/products/lockly-visage-zeno-series\"> $349 at <strong>Lockly</strong></a></li></ul></div>\n<p class=\"has-text-align-none\"><em><em><strong>Connectivity:</strong> Wi-Fi (2.4gHz) / <strong>Access options:</strong> Fingerprint, facial recognition, app, voice, keypad, Home Key, key / <strong>Auto-unlock:</strong> No / <strong>Battery type:</strong> 10,000mAh rechargeable</em> <em>/ <strong>Battery life:</strong> Eight months / <strong>Guest codes:</strong> Yes / <strong><em>Security rating:</em></strong><em> ANSI Grade 1</em></em></em> / <em><em><strong>Works with: </strong>Apple Home, Amazon Alexa, Google Home</em></em></p>\n\n<p class=\"has-text-align-none\">I was very impressed with the <a href=\"https://www.theverge.com/2024/1/8/24025150/lockly-visage-facial-recognition-smart-lock-matter-home-key\">Lockly Visage</a>. The first facial recognition residential smart lock on the market, it also features a fingerprint reader, a keypad, a keyway, and Apple Home Key — that&#8217;s a lot of high-tech ways to unlock your door. And while it&#8217;s probably too much lock for most people, if you are a super smart home user or a major gadget nerd, you’ll love this lock.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/8A0A3510.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p class=\"has-text-align-none\">I was skeptical about the facial unlocking at first, but it worked really well, opening a second or two before I put my hand on the handle. The only caveat is that I had to be approaching face-on, which in most cases I was, but the couple of times I approached from a slightly odd angle, it failed to unlock. In those cases, though, I had the option of using my fingerprint or Home Key.</p>\n\n<p class=\"has-text-align-none\">There’s also a touchscreen keypad, which is mainly useful for handing out codes to guests and visitors whose faces and fingers you don’t want to scan into your lock. The keypad is probably my least favorite part of the lock; it&#8217;s very small, which is good for the overall look, but fiddly to access. It&#8217;s also hard to see in bright light. But with all the other ways to unlock, this isn’t a deal-breaker.</p>\n\n<p class=\"has-text-align-none\">Note that the Visage doesn’t take video or still images; its infrared camera is only used for facial recognition, data for which is stored on the device. Lockly does have <a href=\"https://go.skimresources.com?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Flockly.com%2Fproducts%2Flockly-vision-zeno-series\">a video doorbell version for $429</a>, though that doesn’t have facial recognition.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/8A0A3457.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<p class=\"has-text-align-none\">Surprisingly, despite all the tech packed into it, the lock is compact and stylish-looking and works with the redesigned Lockly Home app, which is now more straightforward and easier to use. The lock works over Wi-Fi and supports Apple Home, Google Home, and Alexa, but there’s no support for Matter.</p>\n\n<p>Lockly claims eight months of battery life with its included rechargeable 10,000mAh battery. Uniquely, it comes with two batteries, so you can swap one and keep the lock online while charging the other. </p>\n\n<p class=\"has-text-align-none\">At $350, the Lockly Visage is very expensive, but considering the tech packed into this lock, plus the two batteries, it’s not outrageous. Its solid build, broad smart home compatibility, and multiple very cool ways to control it make this a great lock.</p>\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<h2 class=\"wp-block-heading\" id=\"6sNDLv\">Other smart locks to consider</h2>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/8A0A3524.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li><a href=\"https://www.theverge.com/2024/9/17/24243714/eufy-smart-lock-e30-matter-thread-apple-home\">Eufy’s $169.99 E30 smart lock</a> works with both Matter-over-Thread and Wi-Fi. It has a fingerprint reader, key, and keypad, and you can use the fingerprint access through the Eufy app while connecting it to platforms like Apple Home through Matter. Unlike the Kwikset Halo Select, you can use Wi-Fi and Thread simultaneously, which is unusual. I’ve not tested it long enough to determine if you still benefit from Thread’s better battery life. It’s cheaper than the Halo, has a fingerprint reader instead of auto-unlock, and promises 8 months of battery life. It can also integrate with a Eufy doorbell to control it from a live view. It has a nice compact design, but the rear housing is huge to fit 8 AA batteries. The lock is loud in operation, and the fingerprint reader was finicky; it also has the lowest ANSI/BHMA rating.</li>\n\n\n\n<li><a href=\"https://u-tec.com/products/ultraloq-bolt-fingerprint-matter\">U-tec’s $199.99 Bolt Fingerprint Matter</a> works over Thread and can be set up directly in your smart home platform of choice — no need to use U-tec’s U Home. But if you want to use its built-in fingerprint reader, you’ll need to download the app. And if you don’t use it, then it&#8217;s kind of a waste of space, so the whole “you only need one app” feature falls flat. I also don’t love the design of the Ultraloqs, while smaller on the exterior than most smart locks, they are squat and chunky looking, resembling a combination lock rather than door hardware. It also uses eight batteries, which is an absurd amount, and is very noisy.</li>\n\n\n\n<li><span>If you’re an Amazon Alexa Ring household, the&nbsp;$206.75 <a href=\"https://www.homedepot.com/pep/Schlage-Century-Aged-Bronze-Encode-Smart-Wi-Fi-Door-Lock-with-Alarm-BE489WB-CEN-716/312499115\" rel=\"noreferrer noopener\" target=\"_blank\">Schlage Encode Wifi</a>&nbsp;lock is a good option; it integrates with the Ring app, so you can lock and unlock it while viewing a live feed from your&nbsp;<a href=\"https://www.theverge.com/22954554/best-video-doorbell-camera\" target=\"_blank\">Ring doorbell</a>.</span> Its design will also match a Schlage door set, which is important for some people. There’s no door-sensing or auto-unlock option, but you have three reliable ways to get in: a key, a PIN, and the app. It also lasts at least six months on one set of four AAs.</li>\n</ul>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/IMG_4467.jpeg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li>If you want Home Key but the Schlage is too expensive or not your style, the $124.99 <a href=\"https://www.amazon.com/Aqara-Keyless-Bluetooth-Deadbolt-Supports/dp/B0CZNZGGS7\">Aqara U50</a> is a good, inexpensive alternative that’s less than half the price of the Schlage. It doesn’t have as good a build quality, and the keypad is a bit finicky, but it works with Apple Home and Home Key out of the box. (You‘ll need an <a href=\"https://www.amazon.com/Aqara-Automation-Controller-Bluetooth-SmartThings/dp/B0CWLHSKYC\">Aqara hub</a> for any other smart home integrations, including Matter.) It also pairs with<a href=\"https://www.theverge.com/23654936/aqara-g4-video-doorbell-review\"> Aqara’s G4 video doorbell</a> to unlock the door while viewing video from the live feed. (Aqara has a <a href=\"https://www.theverge.com/2025/1/6/24334060/aqara-doorbell-camera-hub-g410-smart-home-hub-ces\">doorbell that’s also a hub</a>).</li>\n\n\n\n<li>The <a href=\"https://us.aqara.com/products/smart-lock-u100\">$189.99</a><a href=\"https://www.theverge.com/2023/1/5/23540309/aqara-ces-smart-home-matter-video-doorbell-sensor-lock-price\"> Aqara Smart Lock U100</a> is a <a href=\"https://www.theverge.com/2023/6/8/23753915/matter-smart-lock-aqara-u100-apple-home-key\">Matter-compatible smart lock</a> that also works with Apple HomeKit and Home Key. A full replacement deadlock that can be unlocked by key, keypad, NFC key fob, fingerprint, voice control, through an app, or with Apple Home Key. It&#8217;s a good lock, but its smart home integrations are complicated, and there are now better options.</li>\n\n\n\n<li>The $189.99 <a href=\"https://shopyalehome.com/pages/matter\">Yale Assure SL with Matter Module</a> is a <a href=\"https://www.theverge.com/23165855/thread-smart-home-protocol-matter-apple-google-interview\">Matter-over-Thread</a> deadbolt smart lock. It’s simple, with a clean design and a touchscreen keypad for entry. There’s no keyway, fingerprint reader, or Apple Home Key, but in terms of simplicity, reliability, and future-proofing, it’s a good option. It&#8217;s one of the few locks you can connect directly to your smart home platform of choice without needing to download the manufacturer’s app — the Assure SL doesn’t even work with Yale’s app.</li>\n</ul>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/8A0A1876.webp?quality=90&#038;strip=all&#038;crop=0,0,100,100\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li><span>The $119.99 <a href=\"https://us.switch-bot.com/products/switchbot-lock-pro\">SwitchBot Lock Pro</a>&nbsp;is an all-around upgrade to one of my previous favorite locks, the <a href=\"https://www.theverge.com/23323597/switchbot-lock-review-smart-door-lock\">SwitchBot lock</a> (which is now discontinued). It’s a great solution if you have an unusual lock, as it can work on almost any door; it has higher-quality materials than the original, but now </span>requires you to replace the rear of your lock (as most retrofit locks do). It does support Matter through a bridge, but for $200,<span> I would </span>still opt for Nuki.</li>\n\n\n\n<li>The<a href=\"https://www.kwikset.com/halo-touch\"> Kwikset Halo Touch</a> is a Bluetooth and Wi-Fi fingerprint lock with a traditional keyway. As there’s no keypad, it looks more like a standard lock with the bonus of easy access. This is more limiting when it comes to sharing access to your door, but it’s a good solution for anyone who wants a simple key-free way into their home and knows they won’t need to share lots of digital keys.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/news/674405/tplink-tapo-dl100-smat-deadbolt-door-lock-wifi-bluetooth-battery\">Tapo DL100</a> is a $70 smart lock with built-in Wi-Fi, a keypad, and a physical key, plus access via the Tapo mobile app and smart home integrations. It’s cheaper than my budget pick, the Wyze Bolt, and includes Wi-Fi for remote access, but you don’t get a fingerprint reader. It works with Tapo’s<a href=\"https://www.theverge.com/22954554/best-video-doorbell-camera\"> excellent video doorbells.</a></li>\n</ul>\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<h2 class=\"wp-block-heading\" id=\"7XRNAR\">What’s coming next and what I’m currently testing</h2>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/11/IMG_1221.jpg?quality=90&#038;strip=all&#038;crop=0,5.5555555555556,100,88.888888888889\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li>Aqara <a href=\"https://www.instagram.com/reel/DTLDTD_jiNW/?utm_source=ig_web_copy_link&amp;igsh=MzRlODBiNWFlZA==\">introduced</a> the Matter-compatible <a href=\"https://us.aqara.com/products/smart-lock-u400\">Aqara Smart Lock U400</a> at CES 2026, and <a href=\"https://www.theverge.com/tech/858494/ces-2026-best-new-tech-tv-car-wearable#best-smart-home-device-1\">it was one of the best smart home gadgets</a> we saw at the show. It’s the first smart lock to <a href=\"https://www.theverge.com/2024/6/19/24180813/apple-home-hands-free-unlock-smart-lock-uwb-wwdc-2024\">support Apple’s hands-free Home Key</a> using <a href=\"https://www.theverge.com/smart-home/603957/uwb-hands-free-unlocking-schlage-aliro-apple-samsung-hands-on\">ultra-wideband</a>, letting your door unlock automatically as you approach with a compatible Apple Watch or an iPhone on you. The smart lock also works with the Aliro smart lock standard, which brings a similar experience — along with NFC tap-to-unlock — to Android phones and watches. It costs $269.99 and is available now. <a href=\"https://www.theverge.com/tech/854757/aqara-u400-apple-home-key-hands-free-uwb\">Read our hands-on impressions.</a></li>\n\n\n\n<li>The new <a href=\"https://www.theverge.com/tech/852978/switchbot-lock-vision-deadbolt-facial-recognition\">SwitchBot Lock Vision</a> is another deadbolt smart lock introduced at CES 2026 that uses 3D facial recognition to automatically unlock when it detects your face. Unlike other Switchbot locks, you have to install it directly onto your door rather than retrofitting over an existing lock. SwitchBot will offer two versions of the lock, both of which support Matter over Wi-Fi and include an emergency backup battery. However, the Lock Vision Pro adds fingerprint scanning and contactless palm vein recognition. Pricing and availability haven’t been announced yet.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/news/851622/chamberlain-myq-secure-view-smart-lock-ces-2026\">Chamberlain myQ Secure View 3-in-1 Smart Lock</a> also functions as a 2K HDR video doorbell, and debuted at CES 2026. It can lock your door when it detects a stranger and unlock it when it recognizes people you program via the app for it to recognize, though this feature requires a <a href=\"https://support.chamberlaingroup.com/s/article/myQ-Smart-Secure-FAQ\">myQ subscription</a> that’s $7.99 per month. The lock is available now for $279.99.</li>\n\n\n\n<li>Xthings debuted the <a href=\"https://www.theverge.com/tech/853844/ultraloq-ces-smart-lock-face-palm-reading\">Ultraloq Bolt Sense</a> at CES 2026, a deadbolt that offers facial recognition and contactless palm scanning. Matter support is planned, though it isn’t expected to ship until Q2, after the device is available. The company also introduced the Latch 7 Pro, which doesn’t offer palm vein recognition but will support <a href=\"https://www.theverge.com/23165855/thread-smart-home-protocol-matter-apple-google-interview\">Matter-over-Thread</a> and <a href=\"https://www.theverge.com/2023/11/9/23952637/csa-aliro-new-standard-smart-locks-digital-access\">Aliro</a>.  It’s slated for release in the first quarter.</li>\n\n\n\n<li><a href=\"https://www.theverge.com/tech/851157/lockly-smart-lock-matter-ces\">Lockly’s new Affirm Series smart locks</a> include native Matter support and built-in Wi-Fi, so you won’t need a separate hub. Both deadbolt and latch versions are expected in the second quarter for $179.99.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/news/672367/switchbot-lock-ultra-3d-facial-recognition-price-release-date\">SwitchBot Lock Ultra Vision</a> is a retrofit smart lock that features a keypad with built-in facial recognition. The keypad also has a fingerprint reader and auto-unlock. The lock can work with almost any style of door lock, connects over Bluetooth, and works with Apple Home (through Matter), Amazon Alexa, and Google Home, with a SwitchBot hub. </li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/news/638162/yale-smart-lock-with-matter-works-with-google-home\">Yale Smart Lock with Matter</a> (pictured) is a $170 smart lock that uses Thread and is a full-deadbolt replacement featuring a keypad and keyway for access. It’s designed to pair with Google’s Nest video doorbells.</li>\n\n\n\n<li>The <a href=\"https://u-tec.com/products/ultraloq-bolt-nfc-homekey?srsltid=AfmBOoqSIasydN66rlvEygu8S3Ew6t3zp5Zq-FfF_A6zf9j33tKtCyZd\">Ultraloq Bolt NFC</a> ($249) is U-tec’s first Apple Home Key smart lock, and it <a href=\"https://www.theverge.com/news/777055/ultraloq-adds-android-tap-to-unlock-to-its-apple-home-key-smart-lock\">now supports tap-to-unlock on Android phones</a>. There’s no fingerprint reader, but there is a keypad and a physical key. Built-in Wi-Fi adds support for Amazon Alexa, Google Home, and Samsung SmartThings.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/2025/1/6/24335223/schlage-sense-pro-smart-deadbolt-uwb-matter-thread-ces\">Schlage Sense Pro</a> is the company’s first lock to support <a href=\"https://www.theverge.com/23568091/matter-compatible-devices-accessories-apple-amazon-google-samsung\">Matter</a>&nbsp;and one of the first to use&nbsp;<a href=\"https://www.theverge.com/24313084/smart-lock-home-preview-2025-matter-apple#:~:text=An%20emerging%20technology,and%20watches.\">ultra-wideband technology (UWB)</a>&nbsp;for hands-free unlocking. It has a keypad but no keyway and will work with the <a href=\"https://www.theverge.com/2023/11/9/23952637/csa-aliro-new-standard-smart-locks-digital-access\">Aliro standard</a> when it launches. This means it should support a version of Apple Home Key.</li>\n\n\n\n<li>U-tec’s&nbsp;<a href=\"https://go.skimresources.com/?id=1025X1701640&amp;xs=1&amp;url=https%3A%2F%2Fu-tec.com%2Fproducts%2Fbolt-mission&amp;xcust=__vg0531awD__603957__________________google.com\" rel=\"noreferrer noopener\" target=\"_blank\">Ultraloq Bolt Mission</a>&nbsp;is a $400 lock that will work with UWB for hands-free unlocking; it also has a keypad and a keyway, and the company says it <a href=\"https://www.theverge.com/2024/9/13/24243694/ultraloq-bolt-mission-uwb-matter-smart-lock-apple-home\">will support Matter</a> when it launches.</li>\n\n\n\n<li>Kwikset recently launched the <a href=\"https://www.theverge.com/smart-home/766403/kwisket-halo-select-plus-nfc-home-key-matter\">Aura Reach</a>, a Matter-over-Thread version of its midrange Aura line that costs <a href=\"https://www.amazon.com/Kwikset-Bluetooth-Deadbolt-Proximity-Auto-Unlock/dp/B0G3CPVSZW/\">$189</a>.</li>\n\n\n\n<li><a href=\"https://www.theverge.com/news/779046/wyze-palm-scanning-door-smart-lock\">Wyze’s Palm Lock</a> is a $130 palm-scanning door lock that allows users to unlock their door with the wave of a hand. It uses palm vein recognition to identify registered users, and it can also be unlocked using a physical key, a code, or Wyze’s mobile app. Battery life is rated at up to six months, while a backup battery can power the lock for up to two weeks. It also features Wi-Fi support, so it can be locked and unlocked from anywhere your phone has internet access.</li>\n\n\n\n<li>The <a href=\"https://www.tcl.com/global/en/smart-lock/d2-pro\">TCL D2 Pro</a> is another palm-scanning door lock that promises near-instant recognition and 99.99 percent accuracy. It supports real-time notifications, a 10,000mAh battery, auto-lock, and multiple access options, including a physical key, a keypad, via Google Home or Amazon Alexa, app control, and a key FOB. Additionally, TCL says your data is stored locally for enhanced privacy and security.</li>\n</ul>\n\n<h2 class=\"wp-block-heading has-text-align-none\" id=\"smart-lock-faqs-1\">Smart lock FAQs</h2>\n\n<p><em>Photography by Jennifer Pattison Tuohy / The Verge</em></p>\n\n<p><strong><em>Update, January 14th: </em></strong><em>Mentioned several new smart locks recently introduced at CES 2026 and up</em><em>dated to reflect current pricing / availability. Sheena Vasani and Brandon Russell also contributed to this post.</em></p>",
      "author": "Jennifer Pattison Tuohy",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "01e81ce4-d1ad-4b7a-994f-c9cf9c2cc9cd",
      "title": "Bose’s first-gen QC Ultra headphones have returned to their best price to date",
      "link": "https://www.theverge.com/gadgets/861286/bose-quietcomfort-ultra-headphones-steam-detective-fest-sale-deal",
      "published": "2026-01-14T18:56:54+00:00",
      "summary": "This year’s CES introduced a bevy of unique headphones, including Fender’s first set and a pair that roll up to become a Bluetooth speaker when you want to share your music with friends. However, despite the interesting advancements, we doubt any of them will dethrone our favorite pair for travel: the Bose QuietComfort Ultra Headphones. [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/Bose-QC-Ultra-Headphones-Deal-Image.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\"><a href=\"https://www.theverge.com/tech/836627/ces-2026-news-gadgets-announcements\">This year’s CES</a> introduced a bevy of unique headphones, including <a href=\"https://www.theverge.com/news/850879/fender-mix-wireless-headphones-bluetooth-modular-replaceable-battery\">Fender’s first set</a> and a pair that <a href=\"https://www.theverge.com/tech/851496/tdm-neo-wireless-headphones-bluetooth-speaker-kickstarter\">roll up to become a Bluetooth speaker</a> when you want to share your music with friends. However, despite the interesting advancements, we doubt any of them will dethrone <a href=\"https://www.theverge.com/21345733/best-noise-canceling-headphones\">our favorite pair for travel</a>: the <strong>Bose QuietComfort Ultra Headphones</strong>. Thankfully, the first-gen noise-canceling cans are currently on sale at <a href=\"https://www.amazon.com/dp/B0CCZ1L489/\">Amazon</a>, <a href=\"https://www.bestbuy.com/product/bose-quietcomfort-ultra-wireless-noise-cancelling-over-the-ear-headphones-lunar-blue/J7C5V6TTQR/sku/6589916\">Best Buy</a>, and directly from <a href=\"https://www.bose.com/p/headphones/bose-quietcomfort-ultra-headphones/QCUH-HEADPHONEARN.html\">Bose</a> in several colors for $279 ($150 off), matching their lowest price to date.</p>\n<div class=\"product-block\"><h3>Bose QuietComfort Ultra Headphones</h3>\n<figure class=\"product-image\"><img alt=\"The Bose QuietComfort Ultra Headphones with its case.\" class=\"attachment-medium size-medium\" height=\"200\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/11/Bose-QuietComfort-Ultra-Headphones.png?w=300\" width=\"300\" /></figure>\n<h3>Where to Buy:</h3><ul><li><a href=\"https://www.amazon.com/dp/B0CCZ1L489\"> <strike>$429</strike> $279 at <strong>Amazon</strong></a></li><li><a href=\"https://www.bestbuy.com/product/bose-quietcomfort-ultra-wireless-noise-cancelling-over-the-ear-headphones-lunar-blue/J7C5V6TTQR\"> <strike>$429</strike> $279 at <strong>Best Buy</strong></a></li><li><a href=\"https://www.bose.com/p/headphones/bose-quietcomfort-ultra-headphones/QCUH-HEADPHONEARN.html\"> <strike>$429</strike> $279 at <strong>Bose</strong></a></li></ul></div>\n<p class=\"has-text-align-none\">Although <a href=\"https://www.theverge.com/news/772496/bose-quietcomfort-ultra-anc-wireless-headphones-second-generation-usb-c\">Bose introduced a second-gen pair</a> of the QC Ultra in September, the original flagships offer many of the same hallmarks for $120 less, at least at the moment. They feature a comfortable build and a foldable design that makes them ideal for long flights and road trips, along with a commendable 24 hours of battery life. More importantly, they offer best-in-class noise cancellation and a pleasing, balanced sound signature that preserves highs and lows even when you dial back the volume. That’s on top of a natural-sounding transparency mode designed to pipe outside noise in and an Immersive Audio feature, which, while still hit or miss, can offer new depth to select tracks.</p>\n\n<p class=\"has-text-align-none\">If you do decide to go with the first-gen model over Bose’s latest pair of headphones, you’ll only be giving up a handful of somewhat iterate update. The QC Ultra Headphones (2nd Gen) — which also happen to be on sale for $50 off at <a href=\"http://amazon.com/Bose-QuietComfort-Bluetooth-Headphones-Cancelling/dp/B0FDKR293G\">Amazon</a>, <a href=\"https://www.bestbuy.com/product/bose-quietcomfort-ultra-headphones-2nd-gen-driftwood-sand/J7C5V6W785/sku/6642775\">Best Buy</a>, and <a href=\"https://www.bhphotovideo.com/c/product/1919545-REG/bose_890101_0100_quietcomfort_ultra_wireless_noise.html\">B&amp;H Photo</a> — let you eke out slightly more battery life (30 hours vs. 24 hours), support lossless audio over USB-C, and feature an improved transparency mode. They also support Bluetooth 5.4 and a new Cinema Mode designed to bring dialogue to the forefront, though, for most people, we’d argue none of the features are worth shelling out an additional $120 for.</p>\n\n<h5 class=\"wp-block-heading has-text-align-none\"><a href=\"https://www.theverge.com/23920591/bose-quietcomfort-ultra-headphones-review\">Read our full QC Ultra Headphones review</a>.</h5>\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n<h2 class=\"wp-block-heading has-text-align-none\">More deals and discounts of note</h2>\n\n<ul class=\"wp-block-list\">\n<li>If cracking the case and solving (non-racist) Lovecraftian mysteries is your jam, <a href=\"https://store.steampowered.com/category/detective\"><strong>Steam’s weeklong Detective Fest</strong></a> runs through 1PM ET on January 19th. It’s a lot more curated than Steam’s typical sales events; however, you can still find excellent discounts on <em><a href=\"https://store.steampowered.com/app/1677770/The_Case_of_the_Golden_Idol/\">The Case of the Golden Idol</a></em> ($8.99), <em><a href=\"https://store.steampowered.com/app/632470/Disco_Elysium__The_Final_Cut/\">Disco Elysium</a></em> ($9.99), and plant-based puzzler <em><a href=\"https://store.steampowered.com/app/1574580/Strange_Horticulture/\">Strange Horticulture</a></em> ($6.39). I, for one, will be picking up last year’s most surprising GOTY contender, <em><a href=\"https://store.steampowered.com/app/1569580/Blue_Prince/\">Blue Prince</a></em> ($19.79), along with a <a href=\"https://www.theverge.com/tech/773135/pen-notebook-upgrade-calendar\">fresh set of pen and paper</a> to go with it.</li>\n\n\n\n<li>The <a href=\"https://www.amazon.com/dp/B0BRXJVG1S/\">UE Wonderboom 4</a> has been my go-to Bluetooth smart speaker since it arrived in mid-2024, but <strong>Tribit’s StormBox Mini Plus</strong> remains an excellent budget alternative you can pick up at <a href=\"https://www.amazon.com/dp/B0DSPCW5M5/\">Amazon</a> starting at $29.99 ($10 off), an all-time low. The portable speaker features a fabric-covered cylindrical design that’s eerily familiar to rival models from UE and JBL, not to mention IPX7 waterproofing, a 3.5mm aux input, a speakerphone, and balanced, 360-degree sound that belies its pint-sized stature.</li>\n\n\n\n<li><strong><a href=\"https://www.theverge.com/news/675072/sharge-usb-c-wall-charger-pixelated-led-display\">Sharge’s Pixel 140 charger</a></strong> is currently available from <a href=\"https://www.amazon.com/Charger-Dot-Matrix-Display-Charging-MacBook/dp/B0F9PKSJ17/\">Amazon</a> (for Prime members) and <a href=\"https://sharge.com/products/pixel-100-140-charger?variant=47310497906939\">Sharge</a> for around $79.99 ($20 off), which is just a dollar or two shy of its lowest price to date. The newer, fifth-gen GaN charger swaps the LCD and OLED screens that have <a href=\"https://www.theverge.com/tech/856225/power-banks-are-the-latest-victims-of-feature-creep\">become pervasive in the charging world</a> for a retro-inspired dot matrix display, which lets you see the real-time power draw at a glance. The slick charger also outputs up to 140W and sports three USB-C ports, allowing you to charge all your favorite gadgets.</li>\n</ul>",
      "author": "Brandon Widder",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "051b1729-1017-4980-9c0b-0a4614f51a26",
      "title": "Netflix’s first original podcasts star Pete Davidson and Michael Irvin",
      "link": "https://www.theverge.com/news/861971/netflix-original-podcasts-pete-davidson-michael-irvin",
      "published": "2026-01-14T18:56:28+00:00",
      "summary": "Netflix is launching its first pair of original video podcasts, hosted by Saturday Night Live alum Pete Davidson and NFL commentator and former star Michael Irvin. While The Pete Davidson Show makes its debut on January 30th, you can find Irvin's The White House on the streaming service on January 19th. The two shows will [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/netflix-pete-davidson-show.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Netflix is launching its first pair of original video podcasts, hosted by <a href=\"https://www.netflix.com/tudum/articles/pete-davidson-podcast-news-release-date\"><em>Saturday Night Live</em> alum Pete Davidson</a> and <a href=\"https://www.netflix.com/tudum/articles/white-house-with-michael-irvin-podcast\">NFL commentator and former star Michael Irvin</a>. While <em>The Pete Davidson</em> <em>Show</em> makes its debut on January 30th, you can find Irvin's <em>The White House</em> on the streaming service on January 19th.</p>\n<p class=\"has-text-align-none\">The two shows will join Netflix's growing slate of video podcasts that it has licensed from <a href=\"https://www.theverge.com/news/799582/netflix-spotify-video-podcast-deal\">Spotify</a>, <a href=\"https://www.theverge.com/news/845307/netflix-iheartmedia-video-podcasts\">iHeartMedia</a>, and <a href=\"https://variety.com/2025/tv/news/netflix-dave-portnoy-barstool-sports-exclusive-video-podcasts-1236610822/\">Barstool Sports</a>, including <em>My Favorite Murder</em>, <em>The Bill Simmons Podcast</em>, and <em>Pardon My Take</em>. As part of these deals, the shows licensed by Netflix can't appear in their entirety on YouTube, which has grown to <a href=\"https://www.theverge.com/news/619720/youtube-podcasts-one-billion-monthly-views\">become the bigge …</a></p>\n<p><a href=\"https://www.theverge.com/news/861971/netflix-original-podcasts-pete-davidson-michael-irvin\">Read the full story at The Verge.</a></p>",
      "author": "Emma Roth",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "7cac4377-d080-46e2-9969-bc178337547e",
      "title": "Gemini is winning",
      "link": "https://www.theverge.com/ai-artificial-intelligence/861863/google-gemini-ai-race-winner",
      "published": "2026-01-14T18:16:39+00:00",
      "summary": "If you want to win in AI - and I mean win in the biggest, most lucrative, most shape-the-world-in-your-image kind of way - you have to do a bunch of hard things simultaneously. You need to have a model that is unquestionably one of the best on the market. You need the nearly infinite resources [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/gemini-live-ai-ad.png?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">If you want to win in AI - and I mean win in the biggest, most lucrative, most shape-the-world-in-your-image kind of way - you have to do a bunch of hard things simultaneously. You need to have a model that is unquestionably one of the best on the market. You need the nearly infinite resources required to continue to improve that model and deploy it at massive scale. You need at least one AI-based product that lots of people use, and ideally more than one. And you need access to as much of your users' other data - their personal information, their online activity, even the files on their computer - as you can possibly get. </p>\n<p class=\"has-text-align-none\">Each one of thes …</p>\n<p><a href=\"https://www.theverge.com/ai-artificial-intelligence/861863/google-gemini-ai-race-winner\">Read the full story at The Verge.</a></p>",
      "author": "David Pierce",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    },
    {
      "item_id": "38e433a4-1ecc-48a8-b5c9-5a2c0cc2acac",
      "title": "The Atlantic, Penske, and Vox Media have all sued Google for antitrust violations",
      "link": "https://www.theverge.com/news/861897/atlantic-penske-vox-google-ad-tech-antitrust-lawsuits",
      "published": "2026-01-14T17:47:18+00:00",
      "summary": "Lawsuits seeking damages from Google's illegal ad tech monopoly are piling up following the Justice Department's successful antitrust case. Vox Media, The Verge's parent company, is the latest in a wave of media companies that have filed suit against Google, seeking to be reimbursed for the monopoly profits the tech company allegedly made at publishers' [&#8230;]",
      "content": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/STKS487_Antitrust_STK093_Google_A.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100\" />\n\t<figcaption>\n\t\t</figcaption>\n</figure>\n<p class=\"has-text-align-none\">Lawsuits seeking damages from Google's illegal ad tech monopoly are piling up following the Justice Department's <a href=\"https://www.theverge.com/news/650665/google-loses-ad-tech-antitrust-monopoly-lawsuit\">successful antitrust case</a>. Vox Media, <em>The Verge</em>'s parent company, is the latest in a <a href=\"https://ca.news.yahoo.com/atlantic-sues-google-over-digital-191551431.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAMhnnn4O3ryoOTkDGlTmLsHH27pBjJXfudgZM5wH1ZrUH0F4H2aGhNxomx-TuDHwP7pzxys_mBSJguW6ZW2ujMLs-7b4M4vmJ5B7gdQUDQEAPOYZeSnBwCmaKYqipwpyUnOgoB3kfVUyxxsLD74XuLwed0ybPCGdUippu2DwQK1R\">wave of media companies</a> that have filed suit against Google, seeking to be reimbursed for the monopoly profits the tech company allegedly made at publishers' expense. </p>\n<p class=\"has-text-align-none\">\"Absent Google's conduct, Vox Media would be able to make available even more, higher quality impressions for purchase on Vox Media's webpages and create more high-quality, premium journalism,\" Vox Media alleges in its lawsuit, filed Wednesday in the Southern District of New York. <em> …</em></p>\n<p><a href=\"https://www.theverge.com/news/861897/atlantic-penske-vox-google-ad-tech-antitrust-lawsuits\">Read the full story at The Verge.</a></p>",
      "author": "Lauren Feiner",
      "fetched_at": "2026-01-15T00:18:48.186185+00:00"
    }
  ]
}
